roles/emacs/files/README.org
# -*- evil-shift-width: 2; fill-column: 80; comment-column: 75; -*-
#+startup: show2levels
#+auto_tangle: t
­
* early-init.el
:PROPERTIES:
:header-args: :tangle "./early-init.el"
:END:
These settings are going into different init file: =early-init.el=, which will be
invoked before GUI invocation and general =init.el= file.
** Preamble
#+begin_src emacs-lisp
;;; early-init.el -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in ~/.config/emacs/README.org
;;;
;;; Code:
#+end_src

** Variables

#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum
      read-process-output-max (* 1024 1024 4) ; 4mb
      inhibit-compacting-font-caches t
      message-log-max 16384
      load-prefer-newer noninteractive)
#+end_src

=package.el= initialization is expensive, so we disable it here since we use
=elpaca= instead.

#+begin_src emacs-lisp
(setq package-enable-at-startup nil)
#+end_src

#+begin_src emacs-lisp
(when (featurep 'native-compile)
  (defvar inhibit-automatic-native-compilation)
  (setq inhibit-automatic-native-compilation nil)
  (defvar native-comp-async-report-warnings-errors)
  (setq native-comp-async-report-warnings-errors 'silent))
#+end_src

Prevent the glimpse of un-styled Emacs by disabling these UI elements early.

#+begin_src emacs-lisp
(setq tool-bar-mode nil
      menu-bar-mode nil)
(when (fboundp 'set-scroll-bar-mode)
  (set-scroll-bar-mode nil))
#+end_src

Resizing the Emacs frame can be a terribly expensive part of changing the font.
By inhibiting this, we easily halve startup times with fonts that are larger
than the system default.

#+begin_src emacs-lisp
(setq frame-inhibit-implied-resize t)
#+end_src

** The end of =early-init.el= file
This concludes the =early-init.el= file.

#+begin_src emacs-lisp
(provide 'early-init)
;;; early-init.el ends here
#+end_src


* init.el
:PROPERTIES:
:header-args: :tangle "./init.el"
:END:
** Preamble

#+begin_src emacs-lisp
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in ~/.config/emacs/README.org
;;;
;;; Code:
#+end_src

** Setup =elpaca= package manager
[[https://github.com/progfolio/elpaca][GitHub - progfolio/elpaca: An elisp package manager]]

#+begin_src emacs-lisp
(defvar elpaca-installer-version 0.5)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+end_src

Install use-package support and enable ~:elpaca~ use-package keyword.

#+begin_src emacs-lisp
(elpaca elpaca-use-package
        (elpaca-use-package-mode))
#+end_src

Block until current queue processed.

#+begin_src emacs-lisp
(elpaca-wait)
#+end_src

Make elpaca native keybindings have precedence over evil keymaps in elpaca buffer.
#+begin_src emacs-lisp
(with-eval-after-load 'evil
  (with-eval-after-load 'elpaca-ui   (evil-make-intercept-map elpaca-ui-mode-map))
  (with-eval-after-load 'elpaca-info (evil-make-intercept-map elpaca-info-mode-map)))
#+end_src

** Libraries
*** s, dash, diminish, hydra, ov
#+begin_src emacs-lisp
(use-package s        :elpaca t) ;; string manipulation library
(use-package dash     :elpaca t) ;; list manipulation library
(use-package diminish :elpaca t)
(use-package hydra    :elpaca t)
(use-package ov       :elpaca t) ;; overlays
#+end_src

*** use-package
#+begin_src emacs-lisp
(use-package use-package
  :after general
  :no-require
  :custom (use-package-enable-imenu-support t))
#+end_src

*** which-key
#+begin_src emacs-lisp
(use-package which-key
  :elpaca t
  :diminish which-key-mode
  :custom
  (which-key-idle-delay 0.6)
  (which-key-popup-type 'side-window)
  :init
  (which-key-mode))
#+end_src

*** general
#+begin_src emacs-lisp
(use-package general
  :elpaca t
  :after which-key
  :config
  (general-auto-unbind-keys))
#+end_src

** Keymaps
Define custom keymaps, which I will use later, here in one place.

#+begin_src emacs-lisp
(define-prefix-command 'leader-map)
(define-prefix-command 'semicolon-leader-map)
(define-prefix-command 'my/orgmode-leader-map)
(define-prefix-command 'my/notes-map)
(define-prefix-command 'my/bookmark-map)
#+end_src

** Functions
*** append-to-list
[[https://stackoverflow.com/questions/24356401/how-to-append-multiple-elements-to-a-list-in-emacs-lisp][Source]]
#+begin_src emacs-lisp
(defun my/append-to-list (list-var elements)
  "Append ELEMENTS to the end of LIST-VAR.

The return value is the new value of LIST-VAR."
  (unless (consp elements)
    (error "ELEMENTS must be a list"))
  (let ((list (symbol-value list-var)))
    (if list
        (setcdr (last list) elements)
      (set list-var elements)))
  (symbol-value list-var))
#+end_src

*** dired-open-file
#+begin_src emacs-lisp
(defun my/dired-xdg-open ()
  "In a dired buffer, open file or folder on the current line with `xdg-open'
shell command."
  (interactive)
  (let* ((file (dired-get-filename nil t)))
    (call-process "xdg-open" nil 0 nil file)))
#+end_src

*** paste & indent
Paste and indent after / before.

#+begin_src emacs-lisp
(defun my/paste-and-indent-after ()
  (interactive)
  (with-undo-amagamate ;; emacs 29
   (evil-paste-after 1)
   (evil-indent (evil-get-marker ?\[) (evil-get-marker ?\]))))

(defun my/paste-and-indent-before ()
  (interactive)
  (with-undo-amagamate ;; emacs 29
   (evil-paste-before 1)
   (evil-indent (evil-get-marker ?\[) (evil-get-marker ?\]))))
#+end_src

*** ansi-color
#+begin_src emacs-lisp
(require 'ansi-color)
(defun display-ansi-colors ()
  (interactive)
  (ansi-color-apply-on-region (point-min) (point-max)))
#+end_src

*** toggle line spacing
[[http://xahlee.info/emacs/emacs/emacs_toggle_line_spacing.html][Source]]
#+begin_src emacs-lisp
(defun my/toggle-line-spacing ()
  "Toggle line spacing between no extra space to extra 0.3 line height."
  (interactive)
  (if line-spacing
      (setq line-spacing nil)
    (setq line-spacing 0.3))
  (redraw-frame (selected-frame)))
#+end_src

*** far-fill-paragraph
Provides ~far-fill-paragraph~ function which fills the paragraph at the point.

#+begin_src emacs-lisp
(use-package far
  :elpaca (:host github :repo "eshrh/far.el"))
#+end_src

** Emacs core settings
*** Emacs
#+begin_src emacs-lisp :noweb yes
(use-package better-defaults :elpaca t)
(use-package emacs
  :after better-defaults
  :custom
  <<customize-emacs-variables>>
  :config
  <<config-emacs-settings>>)
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref customize-emacs-variables
:END:

User credentials. Some modes can use full name and e-mail address automatically.
#+begin_src emacs-lisp
(user-full-name "Yuriy Artemyev")
(user-mail-address "anuvyklack@gmail.com")
#+end_src

#+begin_src emacs-lisp
(ring-bell-function #'ignore)
(inhibit-startup-message t)
(cursor-type 'box)
(cursor-in-non-selected-windows nil)
(require-final-newline t)
#+end_src

Do not wrap long lines.

#+begin_src emacs-lisp
(truncate-lines t)
#+end_src

#+begin_src emacs-lisp
(fill-column 80)
#+end_src

#+begin_src emacs-lisp
(comment-empty-lines t)
#+end_src

Always move point into help buffer, when its appeares.

#+begin_src emacs-lisp
(help-window-select t)
(help-at-pt-display-when-idle t)
#+end_src

=M-=== key-chord (evil: =ga=) will show human readable output.

#+begin_src emacs-lisp
(what-cursor-show-names t)
#+end_src

По умолчанию Emacs считает, что предложение дожно заканчиваться 2 пробелами.

#+begin_src emacs-lisp
(sentence-end-double-space nil)
#+end_src

Do not jump half the page when point goes out of the screen.
#+begin_src emacs-lisp
(scroll-conservatively 101)
(scroll-margin 0)
;; (auto-window-vscroll nil)
(scroll-error-top-bottom nil)
(use-short-answers t)
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref config-emacs-settings
:END:

#+begin_src emacs-lisp
;; (menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(horizontal-scroll-bar-mode -1)
(blink-cursor-mode 0)
#+end_src

Show column number in modeline.
#+begin_src emacs-lisp
(column-number-mode 1)
#+end_src

***** COMMENT Yes or No
Prompt for =y= or =n= instead of =yes= or =no=.

#+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

