roles/emacs/files/init.el
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in ~/.config/emacs/README.org
;;;
;;; Code:

(defvar elpaca-installer-version 0.4)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (kill-buffer buffer)
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

(elpaca elpaca-use-package
        (elpaca-use-package-mode))

(elpaca-wait)

(with-eval-after-load 'evil
  (with-eval-after-load 'elpaca-ui   (evil-make-intercept-map elpaca-ui-mode-map))
  (with-eval-after-load 'elpaca-info (evil-make-intercept-map elpaca-info-mode-map)))

(use-package s    :elpaca t) ;; string manipulation library
(use-package dash :elpaca t) ;; list manipulation library
(use-package diminish :elpaca t)
(use-package hydra :elpaca t)

(use-package use-package
  :no-require
  :custom (use-package-enable-imenu-support t))

(use-package general
  :elpaca t
  :config (general-auto-unbind-keys))

(define-prefix-command 'leader-map)
(define-prefix-command 'semicolon-leader-map)
(define-prefix-command 'my/orgmode-leader-map)
(define-prefix-command 'my/notes-map)
(define-prefix-command 'my/bookmark-map)

(defun my/append-to-list (list-var elements)
  "Append ELEMENTS to the end of LIST-VAR.

The return value is the new value of LIST-VAR."
  (unless (consp elements)
    (error "ELEMENTS must be a list"))
  (let ((list (symbol-value list-var)))
    (if list
        (setcdr (last list) elements)
      (set list-var elements)))
  (symbol-value list-var))

(defun my/dired-xdg-open ()
  "In a dired buffer, open file or folder on the current line with `xdg-open'
shell command."
  (interactive)
  (let* ((file (dired-get-filename nil t)))
    (call-process "xdg-open" nil 0 nil file)))

(defun my/paste-and-indent-after ()
  (interactive)
  (with-undo-amagamate ;; emacs 29
   (evil-paste-after 1)
   (evil-indent (evil-get-marker ?\[) (evil-get-marker ?\]))))

(defun my/paste-and-indent-before ()
  (interactive)
  (with-undo-amagamate ;; emacs 29
   (evil-paste-before 1)
   (evil-indent (evil-get-marker ?\[) (evil-get-marker ?\]))))

(use-package better-defaults :elpaca t)
(use-package emacs
  :after better-defaults
  :custom
  (user-full-name "Yuriy Artemyev")
  (user-mail-address "anuvyklack@gmail.com")
  (ring-bell-function #'ignore)
  (inhibit-startup-message t)
  (cursor-type 'box)
  (cursor-in-non-selected-windows nil)
  (require-final-newline t)
  (truncate-lines t)
  (fill-column 80)
  (comment-empty-lines t)
  (help-window-select t)
  (help-at-pt-display-when-idle t)
  (what-cursor-show-names t)
  (sentence-end-double-space nil)
  (scroll-conservatively 101)
  (scroll-margin 0)
  ;; (auto-window-vscroll nil)
  (scroll-error-top-bottom nil)
  (use-short-answers t)
  :config
  ;; (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (horizontal-scroll-bar-mode -1)
  (blink-cursor-mode 0)
  (set-fringe-mode 3)
  (column-number-mode 1))

(when window-system
  (set-face-attribute 'default nil :font "Inconsolata LGC" :height 125)
