roles/emacs/files/README.org
*** Fonts
- [[https://idiocy.org/emacs-fonts-and-fontsets.html][Emacs, fonts and fontsets]]

# *** all-the-icons
# #+begin_src emacs-lisp
# (use-package all-the-icons
#   :elpaca t
#   :config
#   (let ((cache (expand-file-name ".all-the-icons-font-installed"
#                                  user-emacs-directory)))
#     (unless (file-exists-p cache)
#       (all-the-icons-install-fonts t)
#       (with-temp-buffer (write-file cache)))))
# #+end_src

#+begin_src emacs-lisp :noweb yes
(when window-system
  (set-face-attribute 'default nil :font "Inconsolata LGC" :height 125)
  ;; (set-face-attribute 'default nil :font "Roboto Mono" :height 125)
  ;; (set-face-attribute 'default nil :font "Monego" :height 125)
  <<emacs-icons-fonts>>
  <<frame-size-and-position>>)

#+end_src

**** Icons
:PROPERTIES:
:header-args: :noweb-ref emacs-icons-fonts
:END:

Emacs doesn't recognize [[id:0c1a10e0-1456-4e88-aadb-6a7fc45c2930][Vscode Codicons]] and [[id:b5e79f3d-a8e5-4df1-b34b-eee32de54782][Material Design Icons]] fonts.
So for icons need to install [[id:75194bd4-5012-4a57-bf00-f8467afe5bd7][Symbols Nerd Font Mono]] and [[id:bd42899e-c6df-4a9c-a71d-952d4692b507][Material Icons]] fonts.

***** Nerd Font

#+begin_src emacs-lisp
(set-fontset-font t '(?\xf0001 . ?\xf1af0) "Symbols Nerd Font Mono" nil 'prepend)
#+end_src

#+begin_src emacs-lisp
;; (set-fontset-font t ?\xe876 "Material Design Icons" nil 'prepend)
;; (set-fontset-font t ? "Material Design Icons" nil 'prepend)
;; (set-fontset-font t ? "Material Design Icons Desktop" nil 'prepend)
#+end_src

***** Unicode Symbols for Legacy Computing
#+begin_src emacs-lisp
(set-fontset-font t '(?\x1fb00 . ?\x1fbca) "LegacyComputing" nil 'prepend)
(set-fontset-font t '(?🯰 . ?🯹) "LegacyComputing" nil 'prepend)
#+end_src

***** Codicons
#+begin_src emacs-lisp
;; (set-fontset-font t 'latin "Noto Sans")
;; (set-fontset-font t '(?\xea60 . ?\xec11) "codicon" nil 'prepend)

;; (set-fontset-font t '(? . ?) "codicon")

;; (let ((fontset (face-attribute 'default :fontset)))
;;   (set-fontset-font fontset '(?\xea60 . ?\xec11) "codicon" nil 'append))

;; (set-fontset-font (frame-parameter nil 'font)
;;                   '(?\xea60 . ?\xec11)
;;                   (font-spec :family "codicon"
;;                              :weight nil
;;                              :size nil)
;;                   nil
;;                   'prepend)
#+end_src

***** COMMENT FontAwesome
#+begin_src emacs-lisp
(let ((fontset (face-attribute 'default :fontset)))
  (set-fontset-font fontset '(?\xf000 . ?\xf2ff) "FontAwesome" nil 'append))
#+end_src

**** Set initial frame size and position
#+begin_src emacs-lisp :noweb-ref frame-size-and-position
(set-frame-size (selected-frame) 134 63)
(set-frame-position (selected-frame) 1190 35)
#+end_src

*** Custom file
Emacs customization system writes to =init.el= by default, which is not great
when using tangle approach. So move custom modifications to a separate file.

#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

*** Display line numbers
#+begin_src emacs-lisp
(use-package display-line-numbers
  :custom
  ;; (display-line-numbers-width 4)
  (display-line-numbers-grow-only t)
  (display-line-numbers-width-start t)
  :hook (prog-mode . display-line-numbers-mode))
#+end_src

*** Display fill-column indicator
#+begin_src emacs-lisp
(use-package display-fill-column-indicator
  :hook (prog-mode . display-fill-column-indicator-mode))
#+end_src

*** electric-pair
Automatic parens pairing.

#+begin_src emacs-lisp :noweb yes
(use-package elec-pair
  :config
  (electric-pair-mode)
  :hook
  <<electric-pair-hook>>)
#+end_src

**** hook
:PROPERTIES:
:header-args: :noweb-ref electric-pair-hook
:END:

Make =electric-pair= mode not to complete ~<>~ pair when ~<~ char entered in org mode.

#+begin_src emacs-lisp
(org-mode . (lambda ()
              (setq-local electric-pair-inhibit-predicate
                          (lambda (c)
                            (if (char-equal c ?<)
                                t
                              (electric-pair-default-inhibit c))))))
#+end_src

*** Delete selection by typing

#+begin_src emacs-lisp
(use-package delsel
  :config
  (delete-selection-mode))
#+end_src

*** Mouse wheel

#+begin_src emacs-lisp
(use-package mwheel
  :custom
  (mouse-wheel-tilt-scroll t)
  (mouse-wheel-progressive-speed nil))
#+end_src

*** isearch
#+begin_src emacs-lisp
(use-package isearch
  :custom
  (isearch-lazy-count t)
  (isearch-lazy-highlight t))
#+end_src

*** outline
#+begin_src emacs-lisp
(use-package outline
  :custom
  (outline-minor-mode-cycle t))
#+end_src

*** tab-bar-mode
Per-frame tabs, with each tab representing a window configuration (like in Vim).
#+begin_src emacs-lisp :noweb yes 
(use-package tab-bar
  :custom
  <<tab-bar-custom>>
  :config (tab-bar-mode 1))
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref tab-bar-custom
:END:

Show tab numbers.
#+begin_src emacs-lisp
(tab-bar-tab-hints nil)
#+end_src

+Hide tab bar if only 1 tabs open.+
Always show tab bar.
#+begin_src emacs-lisp
;; (tab-bar-show 1)
(tab-bar-show t)
#+end_src

Hide tab close button.
#+begin_src emacs-lisp
(tab-bar-close-button-show nil)
#+end_src

Buffer to show in new tab.
#+begin_src emacs-lisp
;; (tab-bar-new-tab-choice "*dashboard*")
#+end_src

Replace ~tab-bar-format-tabs~ with ~tab-bar-format-tabs-groups~ to make tab bar
displays tab groups. [[https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=f9b737fb9d21ac7adff403274167e76e77d033b8][Source]]
#+begin_src emacs-lisp
(tab-bar-format '(tab-bar-format-history
                  tab-bar-format-tabs-groups
                  tab-bar-separator
                  tab-bar-format-add-tab))
#+end_src

*** info
Tell Emacs where to search Info files of the packages installed with Nix package
manager. (particular =mu4e=)

#+begin_src emacs-lisp
(use-package info
  :config
  (add-to-list 'Info-directory-list
               (expand-file-name ".nix-profile/share/info" (getenv "HOME"))))
#+end_src

*** compile
Convert ansi-colors to emacs faces in compiliers output.
#+begin_src emacs-lisp
(setq ansi-color-for-compilation-mode t)
(add-hook 'compilation-filter-hook 'ansi-color-compilation-filter)
#+end_src

*** fringes
- [[https://emacsredux.com/blog/2015/01/18/customizing-the-fringes/][Customizing the Fringes | Emacs Redux]]

The fringes are used to display symbols that provide information about the text
in the window. You can type =M-x fringe-mode= to disable the fringes, or modify
their width. This command affects fringes in all frames; to modify fringes on
the selected frame only, use =M-x set-fringe-style=. You can make your changes to
the fringes permanent by customizing the variable ~fringe-mode~.

#+begin_src emacs-lisp
(use-package fringe
  :config
  (set-fringe-mode 10) ;; default is 8
  )
#+end_src

** Completion
*** Minibuffer completion
**** COMMENT fido-vertical-mode
#+begin_src emacs-lisp
(use-package icomplete
  :config
  (fido-vertical-mode 1))
#+end_src

**** vertico
#+begin_src emacs-lisp :noweb yes
(use-package vertico
  :elpaca t
  :custom
  <<vertico-custom>>
  :bind (:map minibuffer-local-map
              ("C-h" . backward-kill-word))
  :init
  ;; Add directory with vertico extensions to `load-path'.
  (add-to-list 'load-path (expand-file-name "elpaca/repos/vertico/extensions"
                                            user-emacs-directory))
  <<vertico-init>>
  :config
  <<vertico-config>>
  <<vertico-extensions>>)
#+end_src
***** custom
:PROPERTIES:
:header-args: :noweb-ref vertico-custom
:END:

#+begin_src emacs-lisp
(vertico-count 14) ;; How many candidates to show.
(vertico-scroll-margin 2)
(vertico-cycle nil)
;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer.
(vertico-resize 'grow-only)
#+end_src

*Emacs 28:* Hide commands in =M-x= which do not work in the current mode.
  - Vertico commands are hidden in normal buffers.
  - Corfu commands are hidden, since they are not supposed to be used via =M-x=.
#+begin_src emacs-lisp
(read-extended-command-predicate #'command-completion-default-include-p)
#+end_src

#+begin_src emacs-lisp
(enable-recursive-minibuffers t)
(minibuffer-depth-indicate-mode t)
#+end_src

#+begin_src emacs-lisp
(read-file-name-completion-ignore-case t)
(read-buffer-completion-ignore-case t)
(completion-ignore-case t)
#+end_src

***** init
:PROPERTIES:
:header-args: :noweb-ref vertico-init
:END:

Turn off ~ido-mode~ because [[*Emacs][better-defaults]] package turns it on.
#+begin_src emacs-lisp
(ido-mode -1)
#+end_src

#+begin_src emacs-lisp
(vertico-mode)
#+end_src

***** config
:PROPERTIES:
:header-args: :noweb-ref vertico-config
:END:

#+begin_src emacs-lisp
(defun my/crm-indicator (args)
  "Add prompt indicator to `completing-read-multiple'.
We display [CRM<separator>], e.g., [CRM,] if the separator is a comma."
  (cons (format "[CRM%s] %s"
                (replace-regexp-in-string
                 "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                 crm-separator)
                (car args))
        (cdr args)))

(advice-add #'completing-read-multiple :filter-args #'my/crm-indicator)
#+end_src

Do not allow the cursor in the minibuffer prompt.
#+begin_src emacs-lisp
(setq minibuffer-prompt-properties '(read-only t
                                     cursor-intangible t
                                     face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src

***** vertico-extensions
:PROPERTIES:
:header-args: :noweb-ref vertico-extensions
:END:
****** vertico-repeat
#+begin_src emacs-lisp
(use-package vertico-repeat
  :config
  (keymap-global-set "M-r" #'vertico-repeat)
  (add-hook 'minibuffer-setup-hook #'vertico-repeat-save))
#+end_src

****** COMMENT vertico-multiform
#+begin_src emacs-lisp
(use-package vertico-multiform
  :config
  (vertico-multiform-mode)

  (setq vertico-multiform-commands
        '((consult-line buffer)
          (consult-imenu reverse buffer)
          (execute-extended-command flat)))

  (setq vertico-multiform-categories
        '((file buffer grid)
          (imenu (:not indexed mouse))
          (symbol (vertico-sort-function . vertico-sort-alpha))))

  ;; ;; Configure the display per command.
  ;; ;; Use a buffer with indices for imenu
  ;; ;; and a flat (Ido-like) menu for M-x.
  ;; (setq vertico-multiform-commands
  ;;       '((consult-imenu buffer indexed)
  ;;         (execute-extended-command unobtrusive)))

  ;; ;; Configure the display per completion category.
  ;; ;; Use the grid display for files and a buffer
  ;; ;; for the consult-grep commands.
  ;; (setq vertico-multiform-categories
  ;;       '((file grid)
  ;;         (consult-grep buffer)))
)
#+end_src

