roles/emacs/files/init.el
  ;; (set-face-attribute 'default nil :font "Roboto Mono" :height 125)
  ;; (set-face-attribute 'default nil :font "Monego" :height 125)
  (set-fontset-font t '(?\xf0001 . ?\xf1af0) "Symbols Nerd Font Mono" nil 'prepend)
  ;; (set-fontset-font t ?\xe876 "Material Design Icons" nil 'prepend)
  ;; (set-fontset-font t ? "Material Design Icons" nil 'prepend)
  ;; (set-fontset-font t ? "Material Design Icons Desktop" nil 'prepend)
  (set-fontset-font t '(?\x1fb00 . ?\x1fbca) "LegacyComputing" nil 'prepend)
  ;; (set-fontset-font t 'latin "Noto Sans")
  ;; (set-fontset-font t '(?\xea60 . ?\xec11) "codicon" nil 'prepend)
  
  ;; (set-fontset-font t '(? . ?) "codicon")
  
  ;; (let ((fontset (face-attribute 'default :fontset)))
  ;;   (set-fontset-font fontset '(?\xea60 . ?\xec11) "codicon" nil 'append))
  
  ;; (set-fontset-font (frame-parameter nil 'font)
  ;;                   '(?\xea60 . ?\xec11)
  ;;                   (font-spec :family "codicon"
  ;;                              :weight nil
  ;;                              :size nil)
  ;;                   nil
  ;;                   'prepend)
  (set-frame-size (selected-frame) 134 63)
  (set-frame-position (selected-frame) 1190 35))

(set-frame-size (selected-frame) 134 63)
(set-frame-position (selected-frame) 1190 35)

(setq-default custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))

(use-package display-line-numbers
  :custom
  ;; (display-line-numbers-width 4)
  (display-line-numbers-grow-only t)
  (display-line-numbers-width-start t)
  :hook (prog-mode . display-line-numbers-mode))

(use-package display-fill-column-indicator
  :hook (prog-mode . display-fill-column-indicator-mode))

(use-package elec-pair
  :config
  (electric-pair-mode)
  :hook
  (org-mode . (lambda ()
                (setq-local electric-pair-inhibit-predicate
                            (lambda (c)
                              (if (char-equal c ?<)
                                  t
                                (electric-pair-default-inhibit c)))))))

(use-package delsel
  :config
  (delete-selection-mode))

(use-package mwheel
  :custom
  (mouse-wheel-tilt-scroll t)
  (mouse-wheel-progressive-speed nil))

(use-package isearch
  :custom
  (isearch-lazy-count t)
  (isearch-lazy-highlight t))

(use-package outline
  :custom
  (outline-minor-mode-cycle t))

(use-package tab-bar
  :config (tab-bar-mode 1))

(use-package info
  :config
  (add-to-list 'Info-directory-list
               (expand-file-name ".nix-profile/share/info" (getenv "HOME"))))

(use-package vertico
  :elpaca t
  :custom
  (vertico-count 14) ;; How many candidates to show.
  (vertico-scroll-margin 2)
  (vertico-cycle nil)
  ;; Grow and shrink the Vertico minibuffer
  ;; (setq vertico-resize t)
  ;; (read-extended-command-predicate #'command-completion-default-include-p)
  (enable-recursive-minibuffers t)
  (minibuffer-depth-indicate-mode t)
  (read-file-name-completion-ignore-case t)
  (read-buffer-completion-ignore-case t)
  (completion-ignore-case t)
  :bind (:map minibuffer-local-map
         ("C-h" . backward-kill-word))
  :init
  (ido-mode -1)
  (vertico-mode)
  :config
  (defun my/crm-indicator (args)
    "Add prompt indicator to `completing-read-multiple'.
  We display [CRM<separator>], e.g., [CRM,] if the separator is a comma."
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  
  (advice-add #'completing-read-multiple :filter-args #'my/crm-indicator)
  (setq minibuffer-prompt-properties '(read-only t
                                       cursor-intangible t
                                       face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  (add-to-list 'load-path (expand-file-name "elpaca/repos/vertico/extensions"
                                            user-emacs-directory))
  (use-package vertico-repeat
    :config
    (keymap-global-set "M-r" #'vertico-repeat)
    (add-hook 'minibuffer-setup-hook #'vertico-repeat-save)))
