roles/emacs/files/README.org
**** orderless
#+begin_src emacs-lisp :noweb yes
(use-package orderless
  :elpaca t
  :after vertico
  :custom
  (completion-styles '(orderless basic))
  ;; (completion-styles '(substring orderless))
  ;; (completion-styles '(flex)) ;; fussy search
  (orderless-component-separator #'orderless-escapable-split-on-space)
  (orderless-matching-styles '(orderless-initialism
                               orderless-prefixes
                               orderless-regexp))
  :config
  <<orderless-config>>
  )
#+end_src

**** consult
#+begin_src emacs-lisp
(use-package consult
  :elpaca t
  :init
  (setq completion-in-region-function #'consult-completion-in-region))
#+end_src

**** consult-dir
#+begin_src emacs-lisp
(use-package consult-dir
  :elpaca t
  :bind ("C-x C-d" . consult-dir))
#+end_src

**** marginalia
#+begin_src emacs-lisp
(use-package marginalia
  :elpaca t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy
                           marginalia-annotators-light
                           nil))
  ;; (marginalia-field-width 100)
  :init (marginalia-mode)
  :config
  (general-def :keymaps 'minibuffer-local-map
    :states '(motion insert)
    "M-a" 'marginalia-cycle))
#+end_src

**** all-the-icons-completion
#+begin_src emacs-lisp
(use-package all-the-icons-completion
  :elpaca t
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :init (all-the-icons-completion-mode))
#+end_src

**** embark
#+begin_src emacs-lisp
(use-package embark
  :elpaca t
  :config
  (general-def :states 'motion
    "," 'embark-act
    "M-," 'embark-dwim)
  ;; ;; Show the Embark target at point via Eldoc.  You may adjust the Eldoc
  ;; ;; strategy, if you want to see the documentation from multiple providers.
  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)
  )
#+end_src

***** embark-consult
#+begin_src emacs-lisp
(use-package embark-consult
  :elpaca t
  :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

*** Text completion
**** corfu
#+begin_src emacs-lisp :noweb yes
(use-package corfu
  :elpaca t
  :init
  (global-corfu-mode)
  ;; Add directory with corfu extensions to ~load-path~.
  (add-to-list 'load-path (expand-file-name "elpaca/repos/corfu/extensions"
                                            user-emacs-directory))
  :custom
  <<corfu-custom>>
  :config
  <<corfu-config>>
  <<corfu-extensions>>)
#+end_src
***** custom
:PROPERTIES:
:header-args: :noweb-ref corfu-custom
:END:
****** Corfu custom variables
#+begin_src emacs-lisp
;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
(corfu-auto t)                 ;; Enable auto completion
(corfu-separator ?\s)          ;; Orderless field separator
(corfu-auto-prefix 3)
;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
;; (corfu-preview-current nil)    ;; Disable current candidate preview
;; (corfu-preselect 'prompt)      ;; Preselect the prompt
;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
;; (corfu-scroll-margin 5)        ;; Use scroll margin
#+end_src

****** Emacs custom variables related to completion

=TAB= cycle if there are only few candidates
#+begin_src emacs-lisp
(completion-cycle-threshold 3)
#+end_src

Enable indentation + completion using the =TAB= key.
~completion-at-point~ is often bound to =M-TAB=.
#+begin_src emacs-lisp
(tab-always-indent 'complete)
(tab-first-completion nil)
#+end_src

***** config
:PROPERTIES:
:header-args: :noweb-ref corfu-config
:END:
****** Completing in the minibuffer for commands that doesn't use Vertico
Such as =:= (~evli-ex~), =M-:= (~eval-expression~) and =M-!= (~shell-command~).

Activate ~corfu-mode~ only if ~completion-at-point~ is bound in the ~minibuffer-local~
keymap.

#+begin_src emacs-lisp
(defun corfu-enable-in-minibuffer ()
  "Enable Corfu in the minibuffer if `completion-at-point' is bound."
  (when (where-is-internal #'completion-at-point
                           (list (current-local-map)))
    (setq-local corfu-auto t ;; Enable/disable auto completion
                corfu-echo-delay t ;; Disable automatic echo and popup
                corfu-auto-prefix 2
                corfu-popupinfo-delay nil)
    (corfu-mode 1)))

(add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer)
#+end_src

****** COMMENT Completing for every minibuffer, if no completion UI is active

First we check for Vertico. Then we ensure that Corfu is not enabled if a
password is read from the minibuffer.

#+begin_src emacs-lisp
(defun corfu-enable-always-in-minibuffer ()
  "Enable Corfu in the minibuffer if Vertico are not active."
  (unless (or (bound-and-true-p vertico--input)
              (eq (current-local-map) read-passwd-map))
    (setq-local corfu-auto t ;; Enable/disable auto completion
                corfu-echo-delay t ;; Disable automatic echo and popup
                corfu-auto-prefix 2
                corfu-popupinfo-delay nil)
    (corfu-mode 1)))

(add-hook 'minibuffer-setup-hook #'corfu-enable-always-in-minibuffer 1)
#+end_src

****** Move Corfu list to minibuffer
#+begin_src emacs-lisp
(defun corfu-move-to-minibuffer ()
  (interactive)
  (when completion-in-region--data
    (let ((completion-extra-properties corfu--extra)
          completion-cycle-threshold completion-cycling)
      (apply #'consult-completion-in-region completion-in-region--data))))

(keymap-set corfu-map "M-m" #'corfu-move-to-minibuffer)
(add-to-list 'corfu-continue-commands #'corfu-move-to-minibuffer)
#+end_src

***** corfu extensions
:PROPERTIES:
:header-args: :noweb-ref corfu-extensions
:END:

Remembers selected candidates and sorts the candidates by their history position.
#+begin_src emacs-lisp
(use-package corfu-history
  :config (corfu-history-mode))
#+end_src

Display candidate documentation or source in a popup next to the candidate menu.
#+begin_src emacs-lisp
(use-package corfu-popupinfo
  :custom (corfu-popupinfo-delay (cons 0.5 0.5))
  :config (corfu-popupinfo-mode))
#+end_src

**** kind-icons
#+begin_src emacs-lisp
(use-package kind-icon
  :elpaca t
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

**** dabbrev
Use Dabbrev with Corfu.
#+begin_src emacs-lisp
(use-package dabbrev
  :after cofru
  ;; Swap M-/ and C-M-/
  :bind (("M-/" . dabbrev-completion)
         ("C-M-/" . dabbrev-expand))
  :custom
  (dabbrev-ignored-buffer-regexps '("\\.\\(?:pdf\\|jpe?g\\|png\\)\\'")))
#+end_src

**** orderless
:PROPERTIES:
:header-args: :noweb-ref orderless-config
:END:
Configure a custom style dispatcher (see the [[https://github.com/minad/consult/wiki][Consult wiki]])
#+begin_src emacs-lisp
;; (setq orderless-style-dispatchers '(+orderless-dispatch)
;;       orderless-component-separator #'orderless-escapable-split-on-space)
#+end_src

#+begin_src emacs-lisp
(setq completion-styles '(orderless basic)
      completion-category-defaults nil)
#+end_src

~partial-completion~ for file path expansion. ~partial-completion~ is important for
file wildcard support. Multiple files can be opened at once with ~find-file~ if
you enter a wildcard.

#+begin_src emacs-lisp
(setq completion-category-overrides '((file (styles . (partial-completion)))))
#+end_src

***** COMMENT Fast prefix filtering with Orderless filtering

If you want to combine fast prefix filtering and Orderless filtering you can
still do that by defining a custom Orderless completion style via
~orderless-define-completion-style~. We use a custom style dispatcher, which
enables prefix filtering for input shorter than 4 characters. Note that such a
setup is quite advanced. Please refer to the Orderless documentation and source
code for further details.

#+begin_src emacs-lisp
(defun orderless-fast-dispatch (word index total)
  (and (= index 0) (= total 1) (length< word 4)
       `(orderless-regexp . ,(concat "^" (regexp-quote word)))))

(orderless-define-completion-style orderless-fast
  (orderless-style-dispatchers '(orderless-fast-dispatch))
  (orderless-matching-styles '(orderless-literal orderless-regexp)))

(setq-local corfu-auto t
            corfu-auto-delay 0
            corfu-auto-prefix 0
            completion-styles '(orderless-fast))
#+end_src

**** cape
#+begin_src emacs-lisp
(use-package cape
  :elpaca t
  ;; Bind dedicated completion commands
  ;; Alternative prefix keys: C-c p, M-p, M-+, ...
  :bind (("C-c p p" . completion-at-point) ;; capf
         ("C-c p t" . complete-tag)        ;; etags
         ("C-c p d" . cape-dabbrev)        ;; or dabbrev-completion
         ("C-c p h" . cape-history)
         ("C-c p f" . cape-file)
         ("C-c p k" . cape-keyword)
         ("C-c p s" . cape-symbol)
         ("C-c p a" . cape-abbrev)
         ("C-c p l" . cape-line)
         ("C-c p w" . cape-dict)
         ("C-c p \\" . cape-tex)
         ("C-c p _" . cape-tex)
         ("C-c p ^" . cape-tex)
         ("C-c p &" . cape-sgml)
         ("C-c p r" . cape-rfc1345))
  :init
  ;; Add `completion-at-point-functions', used by `completion-at-point'.
  ;; NOTE: The order matters!
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-elisp-block)
  ;;(add-to-list 'completion-at-point-functions #'cape-history)
  ;;(add-to-list 'completion-at-point-functions #'cape-keyword)
  ;;(add-to-list 'completion-at-point-functions #'cape-tex)
  ;;(add-to-list 'completion-at-point-functions #'cape-sgml)
  ;;(add-to-list 'completion-at-point-functions #'cape-rfc1345)
  ;;(add-to-list 'completion-at-point-functions #'cape-abbrev)
  ;;(add-to-list 'completion-at-point-functions #'cape-dict)
  ;;(add-to-list 'completion-at-point-functions #'cape-symbol)
  ;;(add-to-list 'completion-at-point-functions #'cape-line)
)
#+end_src

** LSP
*** COMMENT lsp-mode
