roles/emacs/files/README.org
**** lsp-mode
#+begin_src emacs-lisp
(use-package lsp-mode
  :elpaca t
  :commands lsp
  :custom
  (lsp-completion-provider :none) ;; I use Corfu
  (lsp-headerline-breadcrumb-enable-diagnostics nil)
  ;; (lsp-headerline-breadcrumb-icons-enable t)
  ;; (lsp-diagnostics-provider :flycheck)
  :init
  (defun my/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless))) ;; Configure orderless
  :hook ((lsp-mode . lsp-enable-which-key-integration)
         (lsp-completion-mode . my/lsp-mode-setup-completion)
         ((c-mode c++-mode) . lsp)
         ))
#+end_src

**** lsp-ui
#+begin_src emacs-lisp
(use-package lsp-ui
  :elpaca t
  :commands lsp-ui-mode
  :config
  ;; (setq lsp-ui-doc-enable nil)
  ;; (setq lsp-ui-doc-delay 0.5)
  (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
  (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
  )
#+end_src

**** lsp-treemacs
#+begin_src emacs-lisp
(use-package lsp-treemacs
  :elpaca t
  :commands lsp-treemacs-errors-list)
#+end_src

**** COMMENT lsp-pyright
#+begin_src emacs-lisp
(use-package lsp-pyright
  :elpaca t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred
#+end_src

**** consult-lsp
#+begin_src emacs-lisp
(use-package consult-lsp
  :elpaca t
  :after '(consult lsp-mode))
#+end_src

**** flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :elpaca t
  :init (global-flycheck-mode)
  :custom
  (flycheck-display-errors-function #'flycheck-display-error-messages-unless-error-list)
  ;; (flycheck-indication-mode nil)
  )
#+end_src

**** flycheck-pos-tip
#+begin_src emacs-lisp
(use-package flycheck-pos-tip
  :elpaca t
  :after flycheck
  :config
  (flycheck-pos-tip-mode))
#+end_src

**** COMMENT dap-mode
#+begin_src emacs-lisp
(use-package dap-mode :elpaca t)
(use-package dap-python :elpaca t)
#+end_src

*** eglot
**** COMMENT eldoc-box
#+begin_src emacs-lisp
(use-package eldoc-box
  :elpaca t
  :config
  (setq eldoc-echo-area-use-multiline-p nil))
  #+end_src

**** eglot
- [[id:c6b7443a-e17f-4795-975d-e852eeddf3eb][eglot example config]]

#+begin_src emacs-lisp :noweb yes 
(use-package project :elpaca t)
(use-package eglot
  :elpaca t
  :after (project projectile cape)
  :preface
  <<eglot-hook>>
  :custom
  <<eglot-custom>>
  :config
  <<eglot-config>>
  )
#+end_src
***** custom
:PROPERTIES:
:header-args: :noweb-ref eglot-custom
:END:
#+begin_src emacs-lisp
(eglot-autoshutdown t)
(eglot-extend-to-xref t)
(eldoc-idle-delay 0.0)
#+end_src

Don't use event's buffer.
#+begin_src emacs-lisp
(eglot-events-buffer-size 0)
#+end_src

#+begin_src emacs-lisp
(flymake-no-changes-timeout 0.5)
#+end_src

***** config
:PROPERTIES:
:header-args: :noweb-ref eglot-config
:END:
#+begin_src emacs-lisp
(advice-add 'eglot-completion-at-point :around #'cape-wrap-buster)
#+end_src

[[https://www.reddit.com/r/emacs/comments/1447fy2/comment/jnev6ca/?utm_source=share&utm_medium=web2x&context=3][Source]]
#+begin_src emacs-lisp
(fset #'jsonrpc--log-event #'ignore)
#+end_src

***** hook
:PROPERTIES:
:header-args: :noweb-ref eglot-hook
:END:
#+begin_src emacs-lisp
(add-hook 'c-mode-hook 'eglot-ensure)
(add-hook 'c++-mode-hook 'eglot-ensure)
#+end_src

#+begin_src emacs-lisp
;; (add-hook 'eglot-managed-mode-hook #'eldoc-box-hover-mode t)
;; (add-hook 'eglot-managed-mode-hook
;;           (lambda ()
;;             "Make sure Eldoc will show us all of the feedback at point."
;;             (setq-local eldoc-documentation-strategy
;;                         #'eldoc-documentation-compose)))
#+end_src

**** consult-eglot
This package provides a single command ~consult-eglot-symbols~ that query
workspace symbol from eglot using consult.

#+begin_src emacs-lisp
(use-package consult-eglot
  :elpaca t
  :after eglot)

;; (setq eglot-server-programs)
#+end_src

** Snippets
*** COMMENT tempel
#+begin_src emacs-lisp
;; Templates that can be used as 'capf'
(use-package tempel
  :after corfu
  :init
  (defun tempel-setup-capf ()
    ;; Add the Tempel Capf to `completion-at-point-functions'.
    ;; `tempel-expand' only triggers on exact matches. Alternatively use
    ;; `tempel-complete' if you want to see all matches, but then you
    ;; should also configure `tempel-trigger-prefix', such that Tempel
    ;; does not trigger too often when you don't expect it. NOTE: We add
    ;; `tempel-expand' *before* the main programming mode Capf, such
    ;; that it will be tried first.
    (setq-local completion-at-point-functions
                (cons #'tempel-expand
                      completion-at-point-functions)))
  :hook
  (prog-mode . tempel-setup-capf)
  (text-mode . tempel-setup-capf))
#+end_src

** COMMENT Smooth scrolling
*** pixel-scroll
#+begin_src emacs-lisp
(use-package pixel-scroll
  :when (fboundp #'pixel-scroll-precision-mode)
  :hook (after-init . pixel-scroll-precision-mode)
  :custom
  (scroll-margin 0)
  ;; pixel-scroll-precision-interpolate-page
  (pixel-scroll-precision-large-scroll-height 40.0)
  )
#+end_src

*** COMMENT good-scroll
#+begin_src emacs-lisp :noweb yes
(use-package good-scroll
  :elpaca t
  :after evil
  :custom (good-scroll-duration 0.3)
  :config
  (good-scroll-mode)
  <<good-scroll-config>>)
#+end_src
**** config
:PROPERTIES:
:header-args: :noweb-ref good-scroll-config
:END:
***** Replaca evil =C-y= / =C-e= keybindings
#+begin_src emacs-lisp
(let ((n 6))
  (define-advice evil-scroll-line-down
      (:around (orig-fun count) triple)
    (funcall orig-fun (* count n)))

  (define-advice evil-scroll-line-up
      (:around (orig-fun count) triple)
    (funcall orig-fun (* count n))))
#+end_src

***** Rebind scrolling keybindings implicitly
By replacing ~scroll-up~ / ~scroll-down~ functions.

#+begin_src emacs-lisp
(defun good-scroll--convert-line-to-step (line)
  (cl-typecase line
    (integer (* line (line-pixel-height)))
    ((or null (member -))
     (- (good-scroll--window-usable-height)
        (* next-screen-context-lines (line-pixel-height))))
    (t (line-pixel-height))))

(defun good-scroll--scroll-up (&optional arg)
  (good-scroll-move (good-scroll--convert-line-to-step arg)))

(defun good-scroll--scroll-down (&optional arg)
  (good-scroll-move (- (good-scroll--convert-line-to-step arg))))

(advice-add 'scroll-up :override 'good-scroll--scroll-up)
(advice-add 'scroll-down :override 'good-scroll--scroll-down)
#+end_src

***** COMMENT Rebind scrolling keybindings explicitly
#+begin_src emacs-lisp
(defun good-scroll-up-half-screen ()
  (interactive)
  (good-scroll-move (/ (good-scroll--window-usable-height) 2)))

(defun good-scroll-down-half-screen ()
  (interactive)
  (good-scroll-move (- (/ (good-scroll--window-usable-height) 2))))

(general-def
  :states 'motion
  "C-d" 'good-scroll-up-half-screen
  "C-u" 'good-scroll-down-half-screen
  "C-f" 'good-scroll-up-full-screen
  "C-b" 'good-scroll-down-full-screen)

(general-def
  "<next>"  'good-scroll-up-full-screen
  "<prior>" 'good-scroll-down-full-screen)
#+end_src

** Structural editing
*** COMMENT symex
#+begin_src emacs-lisp
(use-package symex
  :elpaca t
  ;; :config
  ;; (symex-initialize)
  ;; (global-set-key (kbd "s-;") 'symex-mode-interface)
  ;; (symex-modal-backend 'evil)
  )
#+end_src

*** COMMENT puni
#+begin_src emacs-lisp
(use-package puni
  :elpaca t
  :defer t
  :hook
  (term-mode . puni-disable-puni-mode)
  :init
  ;; The autoloads of Puni are set up so you can enable `puni-mode` or
  ;; `puni-global-mode` before `puni` is actually loaded. Only after you press
  ;; any key that calls Puni commands, it's loaded.
  (puni-global-mode))
#+end_src

*** COMMENT lispy
#+begin_src emacs-lisp
(use-package lispy
  :elpaca t
  :custom
  (lispy-safe-delete t)
  (lispy-safe-copy t)
  (lispy-safe-paste t)
  :hook (emacs-lisp-mode . lispy-mode))
#+end_src

*** COMMENT lispyville
#+begin_src emacs-lisp :noweb yes
(use-package lispyville
  :elpaca t
  :after general
  :hook (lispy-mode . my/lispyville-mode)
  :config
  <<lispyville-config>>)
#+end_src
**** config
:PROPERTIES:
:header-args: :noweb-ref lispyville-config
:END:

#+begin_src emacs-lisp
(lispyville-set-key-theme
 '(operators c-w c-u prettify additional-motions additional wrap))
#+end_src

#+begin_src emacs-lisp
(defun my/lispyville-mode ()
  (lispyville-mode)
  (general-def
    :keymaps 'local
    :states 'normal
    "(" 'lispyville-backward-up-list
    "g c" 'lispyville-comment-or-uncomment
    "[ SPC" 'evil-collection-unimpaired-insert-newline-above
    "] SPC" 'evil-collection-unimpaired-insert-newline-below)
  (general-def
    :keymaps 'local
    :states '(motion normal visual)
    ";" '(:keymap semicolon-leader-map)
    ;; ";" '(:keymap evilem-map)
    )
  (general-def
    :keymaps 'local
    :states 'visual
    "g c" 'lispyville-comment-or-uncomment))
#+end_src

** Tools
*** COMMENT which-key-posframe
[[https://github.com/emacsorphanage/which-key-posframe][GitHub - emacsorphanage/which-key-posframe]]

#+begin_src emacs-lisp
(use-package which-key-posframe
  :elpaca t
  :after which-key
  :custom
  (which-key-posframe-poshandler 'posframe-poshandler-frame-bottom-center)
  :config
  (which-key-posframe-mode))
#+end_src

*** avy
#+begin_src emacs-lisp
(use-package avy
  :elpaca t
  :custom
  (avy-background t)
  (avy-keys (number-sequence ?a ?z)) ;; Any lower-case letter a-z.
  (avy-style 'at-full)
  (avy-all-windows nil)
  (avy-words)
  :config
  (set-face-attribute 'avy-lead-face nil :foreground "red" :background nil :weight 'bold)
  (set-face-attribute 'avy-lead-face-0 nil :foreground "brown" :background nil) ;:weight 'bold
  ;; (set-face-attribute 'avy-lead-face-1 nil :background "green" :foreground "yellow")
  ;; (set-face-attribute 'avy-lead-face-2 nil :background "green" :foreground "yellow")
  )
#+end_src

*** expand-region
#+begin_src emacs-lisp
(use-package expand-region
  :elpaca t
  :after evil-collection
  :custom
  (expand-region-contract-fast-key "C-v")
  :config
  (general-def
    :states 'visual
    "v" 'er/expand-region))

;; (defun my/collapse-region ()
;;   (interactive)
;;   (er/expand-region -1))
;; (general-def
;;   :states 'visual
;;   "v" 'er/expand-region
;;   "C-v" 'my/collapse-region)
#+end_src

*** magit
#+begin_src emacs-lisp
(use-package magit
  :elpaca t
  :custom
  (evil-collection-magit-use-z-for-folds t) ;; use Z for stash instead
  (evil-collection-magit-use-$-for-end-of-line nil)) ;; use $ for `magit-process-buffer'
#+end_src

*** zoxide
#+begin_src emacs-lisp
(use-package zoxide
  :elpaca t
  :bind (:map leader-map
              ("fz" . zoxide-find-file)))
#+end_src

*** gcmh (Garbage Collector Magic Hack)
https://gitlab.com/koral/gcmh

#+begin_src emacs-lisp
(use-package gcmh
  :elpaca t
  :diminish
  :config (gcmh-mode 1))
#+end_src

*** no-littering
#+begin_src emacs-lisp
(use-package no-littering
  :elpaca t
  :demand t
  :config
  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (convert-standard-filename
      (expand-file-name  "var/eln-cache/" user-emacs-directory)))))
#+end_src

*** recentf
Save recent files.

#+begin_src emacs-lisp
(use-package recentf
  :after no-littering
  :custom
  (recentf-max-menu-items 100)
  (recentf-max-saved-items 100)
  :config
  (recentf-mode 1)
  ;; ;; Save recentf list into file every 10 minutes.
  ;; (run-at-time nil 600 'recentf-save-list)
  )
#+end_src

*** savehist
Save minibuffer history.

#+begin_src emacs-lisp
(use-package savehist
  :after no-littering
  ;; :custom
  ;; (savehist-additional-variables '(register-alist))
  :config
  (savehist-mode)
  (setq savehist-additional-variables '(register-alist)))
#+end_src

*** projectile
#+begin_src emacs-lisp
(use-package projectile
  :elpaca t
  :custom
  (projectile-auto-discover t)
  (projectile-project-search-path '("~"))
  :config
  (projectile-mode)
  (general-def :keymaps 'projectile-command-map
    "B" 'projectile-ibuffer)
  (keymap-unset projectile-command-map "I" t))

#+end_src

