roles/emacs/files/init.el

(use-package lsp-mode
  :elpaca t
  :init
  :hook (;; (python-mode . lsp)
         (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp)

(use-package lsp-ui :elpaca t :commands lsp-ui-mode)
;; (use-package lsp-treemacs :elpaca t :commands lsp-treemacs-errors-list)

(use-package puni
  :disabled
  :elpaca t
  :defer t
  :hook
  (term-mode . puni-disable-puni-mode)
  :init
  ;; The autoloads of Puni are set up so you can enable `puni-mode` or
  ;; `puni-global-mode` before `puni` is actually loaded. Only after you press
  ;; any key that calls Puni commands, it's loaded.
  (puni-global-mode))

(use-package lispy
  :elpaca t
  :custom
  (lispy-safe-delete t)
  (lispy-safe-copy t)
  (lispy-safe-paste t)
  :hook (emacs-lisp-mode . lispy-mode))

(use-package lispyville
  :elpaca t
  :after general
  :hook (lispy-mode . my/lispyville-mode)
  :config
  (lispyville-set-key-theme
   '(operators c-w c-u prettify additional-motions additional wrap))
  (defun my/lispyville-mode ()
    (lispyville-mode)
    (general-def
      :keymaps 'local
      :states 'normal
      "(" 'lispyville-backward-up-list
      "g c" 'lispyville-comment-or-uncomment
      "[ SPC" 'evil-collection-unimpaired-insert-newline-above
      "] SPC" 'evil-collection-unimpaired-insert-newline-below)
    (general-def
      :keymaps 'local
      :states '(motion normal visual)
      ";" '(:keymap semicolon-leader-map)
      ;; ";" '(:keymap evilem-map)
      )
    (general-def
      :keymaps 'local
      :states 'visual
      "g c" 'lispyville-comment-or-uncomment)))

(use-package which-key
  :elpaca t
  :diminish which-key-mode
  :custom
  (which-key-idle-delay 1.2)
  (which-key-popup-type 'side-window)
  :init
  (which-key-mode))

(use-package avy
  :elpaca t
  :custom
  (avy-background t)
  (avy-keys (number-sequence ?a ?z)) ;; Any lower-case letter a-z.
  (avy-style 'at-full)
  (avy-all-windows nil)
  (avy-words)
  :config
  (set-face-attribute 'avy-lead-face nil :foreground "red" :background nil :weight 'bold)
  (set-face-attribute 'avy-lead-face-0 nil :foreground "brown" :background nil) ;:weight 'bold
  ;; (set-face-attribute 'avy-lead-face-1 nil :background "green" :foreground "yellow")
  ;; (set-face-attribute 'avy-lead-face-2 nil :background "green" :foreground "yellow")
  )

(use-package expand-region
  :elpaca t
  :after evil-collection
  :custom
  (expand-region-contract-fast-key "C-v")
  :config
  (general-def
    :states 'visual
    "v" 'er/expand-region))

(use-package magit
  :elpaca t
  :custom
  (evil-collection-magit-use-z-for-folds t) ;; use Z for stash instead
  (evil-collection-magit-use-$-for-end-of-line nil)) ;; use $ for `magit-process-buffer'

(use-package zoxide
  :elpaca t
  :bind (:map leader-map
         ("fz" . zoxide-find-file)))

(use-package gcmh
  :elpaca t
  :diminish
  :config (gcmh-mode 1))

(use-package no-littering
  :elpaca t
  :demand t
  :config
  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
      (convert-standard-filename
        (expand-file-name  "var/eln-cache/" user-emacs-directory)))))

(use-package recentf
  :after no-littering
  :custom
  (recentf-max-menu-items 100)
  (recentf-max-saved-items 100)
  :config
  (recentf-mode 1)
  ;; ;; Save recentf list into file every 10 minutes.
  ;; (run-at-time nil 600 'recentf-save-list)
  )

(use-package savehist
  :after no-littering
  ;; :custom
  ;; (savehist-additional-variables '(register-alist))
  :config
  (savehist-mode)
  (setq savehist-additional-variables '(register-alist)))

(use-package projectile
  :elpaca t
  ;; :custom
  ;; (projectile-auto-discover t)
  ;; (projectile-project-search-path)
  :config
  (projectile-mode)
  (general-def :keymaps 'projectile-command-map
    "B" 'projectile-ibuffer)
  (keymap-unset projectile-command-map "I" t))
