roles/emacs/files/README.org
**** consult-projectile
#+begin_src emacs-lisp
(use-package consult-projectile
  :elpaca t
  ;; :straight (consult-projectile
  ;;            :type git :host gitlab
  ;;            :repo "OlMon/consult-projectile" :branch "master")
  :bind (([remap projectile-switch-to-buffer] . consult-projectile-switch-to-buffer)
         ([remap projectile-find-dir] . consult-projectile-find-dir)
         ([remap projectile-find-file] . consult-projectile-find-file)
         ([remap projectile-recentf] . consult-projectile-recentf)
         ;; ([remap projectile-switch-project] . consult-projectile-switch-project)
         ([remap projectile-switch-project] . consult-projectile)))
#+end_src

*** origami
#+begin_src emacs-lisp
(use-package origami
  :elpaca t
  ;; :custom
  ;; (origami-show-fold-header t) ;; highlight fold headers
  ;; :config
  ;; (global-origami-mode 1)
  ;; (setq origami-fold-style 'triple-braces)
  )
#+end_src

*** helpful
#+begin_src emacs-lisp
(use-package helpful
  :elpaca t
  ;; :preface
  ;; (add-to-list 'load-path "~/code/emacs/helpful")
  :bind (([remap describe-function] . helpful-callable)
         ([remap describe-variable] . helpful-variable)
         ([remap describe-command] . helpful-command)
         ([remap describe-key] . helpful-key)
         :map help-map
         ("F" . helpful-function)))
#+end_src

*** rainbow-delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :elpaca t
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** rg
#+begin_src emacs-lisp
(use-package rg
  :elpaca t)
#+end_src

*** easy-escape
#+begin_src emacs-lisp
(use-package easy-escape
  :elpaca t
  :hook (emacs-lisp-mode . easy-escape-minor-mode))
#+end_src

*** flyspell
**** flyspell
#+begin_src emacs-lisp
(use-package flyspell
  :custom
  (flyspell-issue-message-flag nil))
#+end_src

**** flyspell-correct
Spell check

#+begin_src emacs-lisp
(use-package flyspell-correct
  :elpaca t
  :hook ((markdown-mode . flyspell-mode)
         ;; (org-mode . flyspell-mode)
         ;; (text-mode . flyspell-mode)
         ))
#+end_src

**** flyspell-correct-popup
#+begin_src emacs-lisp
(use-package flyspell-correct-popup
  :elpaca t
  :after flyspell-correct)
#+end_src

*** vundo
#+begin_src emacs-lisp
(use-package vundo
  :elpaca (:host github :repo "casouri/vundo")
  :custom
  (vundo-glyph-alist vundo-unicode-symbols)
  ;; (vundo-roll-back-on-quit nil)
  (vundo-compact-display nil)
  :config
  (general-def
    ;; :keymaps 'leader-map
    :states 'normal
    "U" 'vundo))
#+end_src

*** anzu
#+begin_src emacs-lisp
(use-package anzu
  :elpaca t
  :config
  (global-anzu-mode))
#+end_src

*** unpackaged
[[https://github.com/alphapapa/unpackaged.el#flexibly-fillunfill-paragraphs][Source]]
#+begin_src emacs-lisp
(defvar unpackaged/flex-fill-paragraph-column nil
  "Last fill column used in command `unpackaged/flex-fill-paragraph'.")

;;;###autoload
(defun unpackaged/flex-fill-paragraph (&optional fewer-lines unfill)
  "Fill paragraph, incrementing fill column to cause a change when repeated.
The global value of `fill-column' is not modified; it is only
bound around calls to `fill-paragraph'.

When called for the first time in a sequence, unfill to the
default `fill-column'.

When called repeatedly, increase `fill-column' until filling
changes.

With one universal prefix, increase `fill-column' until the
number of lines is reduced.  With two, unfill completely."
  (interactive "P")
  (let* ((fewer-lines (or fewer-lines (equal current-prefix-arg '(4))))
         (unfill (or unfill (equal current-prefix-arg '(16))))
         (fill-column
          (cond (unfill (setf unpackaged/flex-fill-paragraph-column nil)
                        most-positive-fixnum)
                (t (setf unpackaged/flex-fill-paragraph-column
                         (if (equal last-command this-command)
                             (or (unpackaged/flex-fill-paragraph--next-fill-column fewer-lines)
                                 fill-column)
                           fill-column))))))
    (fill-paragraph)
    (message "Fill column: %s" fill-column)))

(defun unpackaged/flex-fill-paragraph--next-fill-column (&optional fewer-lines)
  "Return next `fill-column' value.
If FEWER-LINES is non-nil, reduce the number of lines in the
buffer, otherwise just change the current paragraph."
  ;; This works well, but because of all the temp buffers, sometimes when called
  ;; in rapid succession, it can cause GC, which can be noticeable.  It would be
  ;; nice to avoid that.  Note that this has primarily been tested on
  ;; `emacs-lisp-mode'; hopefully it works well in other modes.
  (let* ((point (point))
         (source-buffer (current-buffer))
         (mode major-mode)
         (fill-column (or unpackaged/flex-fill-paragraph-column fill-column))
         (old-fill-column fill-column)
         (hash (unless fewer-lines
                 (buffer-hash)))
         (original-num-lines (when fewer-lines
                               (line-number-at-pos (point-max)))))
    (with-temp-buffer
      (delay-mode-hooks
        (funcall mode))
      (setq-local fill-column old-fill-column)
      (insert-buffer-substring source-buffer)
      (goto-char point)
      (cl-loop while (fill-paragraph)
               ;; If filling doesn't change after 100 iterations, abort by returning nil.
               if (> (- fill-column old-fill-column) 100)
               return nil
               else do (cl-incf fill-column)
               while (if fewer-lines
                         (= original-num-lines (line-number-at-pos (point-max)))
                       (string= hash (buffer-hash)))
               finally return fill-column))))
#+end_src

*** visual-fill-column
#+begin_src emacs-lisp
(use-package visual-fill-column
  :elpaca t
  :custom
  (visual-fill-column-center-text t)
  :config
  ;; (visual-line-mode) ;; Wrap long lines on words.
  (add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
  )
#+end_src

*** COMMENT adaptive-wrap
#+begin_src emacs-lisp
(use-package adaptive-wrap
  :elpaca t
  :config
  (adaptive-wrap-prefix-mode))
#+end_src

*** COMMENT moom
#+begin_src emacs-lisp
(use-package moom
  :elpaca t
  :after transient
  :init
  (when window-system
    (set-face-attribute 'default nil :font "Inconsolata LGC" :height 125))
  :config
  (moom-mode 1)
  (moom-move-frame-to-edge-right))
#+end_src

*** COMMENT elisp-demos
#+begin_src emacs-lisp
(use-package elisp-demos
  :elpaca t
  :after helpful
  :config
  (advice-add #'helpful-update :after #'elisp-demos-advice-helpful-update))
#+end_src

*** COMMENT zoom
#+begin_src emacs-lisp
(use-package zoom
  :elpaca t
  :custom
  (split-width-threshold 130) ;; Threshold to split window horizontally.
  (zoom-mode t)
  (zoom-ignored-major-modes '(dired-mode))
  (temp-buffer-resize-mode t))
#+end_src

*** COMMENT fancy-compilation
#+begin_src emacs-lisp
(use-package fancy-compilation
  :elpaca t
  :config
  (fancy-compilation-mode))
#+end_src

** Dired
*** COMMENT Dirvish
#+begin_src emacs-lisp :noweb yes 
(use-package dirvish
  :elpaca t
  :custom
  <<dirvish-custom>>
  ;; :hook ((dired-mode . dired-omit-mode)
  ;;        ;; (dired-mode . dired-hide-details-mode)
  ;;        )
  ;; :bind (([remap dired] . dirvish-dwim)
  ;;        ([remap dired-sort-toggle-or-edit] . dirvish-quicksort)
  ;;        ([remap dired-do-redisplay] . dirvish-ls-switches-menu)
  ;;        ([remap dired-do-copy] . dirvish-yank-menu))
  :config
  (dirvish-override-dired-mode)
  (dirvish-peek-mode)
  ;; (dirvish-side-follow-mode)
  (setq dirvish-preview-dispatchers
        (cl-substitute 'pdf-preface 'pdf dirvish-preview-dispatchers))
  (defun dirvish-ibuffer ()
    (interactive)
    (dirvish-quit)
    (ibuffer))
  )
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref dirvish-custom
:END:

| *-l*               | use a long listing format                     |
| *-a*, *--all*        | do not ignore entries starting with =.=         |
| *-A*, *--almost-all* | do not list implied =.= and =..=                  |
| *-F*, *--classify*   | append indicator (one of =*/=>@¦=) to entries   |
| *-v*               | natural sort of (version) numbers within text |

#+begin_src emacs-lisp
(dired-listing-switches "-lAh -v --group-directories-first")
;; (dired-listing-switches "-lAhF -v --group-directories-first")
;; (dired-listing-switches "-l --human-readable --group-directories-first")
#+end_src

#+begin_src emacs-lisp
(dired-kill-when-opening-new-dired-buffer t)
(delete-by-moving-to-trash t)
(dired-recursive-deletes 'always)
(dired-recursive-copies 'always)
(dired-no-confirm t)
(dired-dwim-target t)
(dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'\\|\\`[.].+")
#+end_src

#+begin_src emacs-lisp
(dirvish-default-layout '(0 0.4 0.6))
(dirvish-layout-recipes '((0 1 0)
                          (0 0.4 0.6)))
(dirvish-attributes '(vc-state file-size subtree-state collapse all-the-icons))
(dirvish-side-width 38)
(dirvish-mode-line-format '(:left (sort symlink) :right (vc-info yank index)))
(dirvish-header-line-format '(:left (path) :right (free-space)))
#+end_src

#+begin_src emacs-lisp
(dirvish-open-with-programs (let ((qimgv (executable-find "qimgv"))
                                  (vlc   (executable-find "vlc")))
                              `((,dirvish-image-exts ,qimgv "%f")
                                (,dirvish-video-exts ,vlc "%f"))))
#+end_src

#+begin_src emacs-lisp
(dirvish-quick-access-entries
 `(("h" "~/"                          "Home")
   ("d" "~/Downloads/"                "Downloads")
   ("m" "/run/media/"                 "Drives")
   ("t" "~/.local/share/Trash/files/" "TrashCan")
   ("e" ,user-emacs-directory         "Emacs")))
#+end_src

*** Dired
**** dired
#+begin_src emacs-lisp :noweb yes
(use-package dired
  :custom
  <<dired-custom>>
  :hook
  (dired-mode . dired-omit-mode)
  (dired-mode . dired-hide-details-mode)
  (dired-mode . hl-line-mode))
#+end_src
***** custom
:PROPERTIES:
:header-args: :noweb-ref dired-custom
:END:

| *-l*               | use a long listing format                     |
| *-a*, *--all*        | do not ignore entries starting with =.=         |
| *-A*, *--almost-all* | do not list implied =.= and =..=                  |
| *-F*, *--classify*   | append indicator (one of =*/=>@¦=) to entries   |
| *-v*               | natural sort of (version) numbers within text |

#+begin_src emacs-lisp
(dired-listing-switches "-lAhF -v --group-directories-first")
;; (dired-listing-switches "-l --human-readable --group-directories-first")
#+end_src

#+begin_src emacs-lisp
(dired-kill-when-opening-new-dired-buffer t)
(delete-by-moving-to-trash t)
(dired-recursive-deletes 'always)
(dired-recursive-copies 'always)
(dired-no-confirm t)
(dired-dwim-target t)
(dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'\\|\\`[.].+")
#+end_src

**** dired-hacks
[[https://github.com/Fuco1/dired-hacks][GitHub - Fuco1/dired-hacks: Collection of useful dired additions]]

#+begin_src emacs-lisp
(use-package dired-ranger  :elpaca t)
(use-package dired-subtree :elpaca t)
(use-package dired-narrow  :elpaca t)
(use-package dired-open    :elpaca t)
(use-package dired-toggle-sudo :elpaca t)
#+end_src

**** wdired
#+begin_src emacs-lisp
(use-package wdired
  ;; :custom (wdired-allow-to-change-permissions t)
  )
#+end_src

**** dired-collapse
Toggle collapsing of unique nested paths in Dired.

#+begin_src emacs-lisp
(use-package dired-collapse
  :elpaca t
  ;; :hook (dired-mode . dired-collapse-mode)
  )
#+end_src

**** dired-rainbow
#+begin_src emacs-lisp
(use-package dired-rainbow
  :elpaca t
  :config
  (dired-rainbow-define html "#4e9a06" ("htm" "html" "xhtml"))
  (defconst my-video-files-extensions
    '("mp3" "mp4" "MP3" "MP4" "avi" "mpg" "flv" "ogg" "mkv")
    "Media files.")
  (dired-rainbow-define media "#ce5c00" my-video-files-extensions)
  ;; Highlight executable files, but not directories:
  (dired-rainbow-define-chmod executable-unix "#4e9a06" "-.*x.*"))
#+end_src

**** diredfl
Addtional syntax highlighting for dired
#+begin_src emacs-lisp
(use-package diredfl ;; Addtional syntax highlighting for dired
  :elpaca t
  :hook ((dired-mode . diredfl-mode)
         (dirvish-directory-view-mode . diredfl-mode))
  ;; :config
  ;; (set-face-attribute 'diredfl-dir-name nil :bold t)
  )
#+end_src

