roles/emacs/files/init.el

(use-package consult-projectile
  :elpaca t
  ;; :straight (consult-projectile
  ;;            :type git :host gitlab
  ;;            :repo "OlMon/consult-projectile" :branch "master")
  :bind (([remap projectile-switch-to-buffer] . consult-projectile-switch-to-buffer)
         ([remap projectile-find-dir] . consult-projectile-find-dir)
         ([remap projectile-find-file] . consult-projectile-find-file)
         ([remap projectile-recentf] . consult-projectile-recentf)
         ;; ([remap projectile-switch-project] . consult-projectile-switch-project)
         ([remap projectile-switch-project] . consult-projectile)
         ))

(use-package helpful
  :elpaca t
  ;; :preface
  ;; (add-to-list 'load-path "~/code/emacs/helpful")
  :bind (([remap describe-function] . helpful-callable)
         ([remap describe-variable] . helpful-variable)
         ([remap describe-command] . helpful-command)
         ([remap describe-key] . helpful-key)
         :map help-map
         ("F" . helpful-function)))

(use-package rainbow-delimiters
  :elpaca t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rg
  :elpaca t)

(use-package easy-escape
  :elpaca t
  :hook (emacs-lisp-mode . easy-escape-minor-mode)
  ;; :config
  ;; (add-hook 'emacs-lisp-mode-hook 'easy-escape-minor-mode)
  )

(use-package far
  :elpaca (:host github :repo "eshrh/far.el"))

(use-package flyspell-correct
  :elpaca t
  :hook ((markdown-mode . flyspell-mode)
         ;; (text-mode . flyspell-mode)
         ))

(use-package flyspell-correct-popup
  :elpaca t
  :after flyspell-correct)

(use-package vundo
  :elpaca (:host github :repo "casouri/vundo")
  :custom
  (vundo-glyph-alist vundo-unicode-symbols)
  ;; (vundo-roll-back-on-quit nil)
  (vundo-compact-display nil)
  :config
  (general-def
    ;; :keymaps 'leader-map
    :states 'normal
    "U" 'vundo))

(use-package anzu
  :elpaca t
  :config
  (global-anzu-mode))

(use-package dired
  :custom
  (dired-listing-switches "-lahF -v --group-directories-first")
  (dired-kill-when-opening-new-dired-buffer t)
  (dired-no-confirm t)
  (dired-recursive-deletes 'always)
  (dired-recursive-copies 'always)
  (delete-by-moving-to-trash t)
  (dired-dwim-target t)
  (dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'\\|\\`[.].+")
  :hook
  (dired-mode . dired-omit-mode)
  (dired-mode . dired-hide-details-mode)
  (dired-mode . hl-line-mode))

(use-package dired-ranger  :elpaca t)
(use-package dired-subtree :elpaca t)
(use-package dired-narrow  :elpaca t)
(use-package dired-open    :elpaca t)
(use-package dired-toggle-sudo :elpaca t)

(use-package wdired
  ;; :custom (wdired-allow-to-change-permissions t)
  )

(use-package dired-collapse
  :elpaca t
  ;; :hook (dired-mode . dired-collapse-mode)
  )

(use-package dired-rainbow
  :elpaca t
  :config
  (dired-rainbow-define html "#4e9a06" ("htm" "html" "xhtml"))
  (defconst my-video-files-extensions
    '("mp3" "mp4" "MP3" "MP4" "avi" "mpg" "flv" "ogg" "mkv")
    "Media files.")
  (dired-rainbow-define media "#ce5c00" my-video-files-extensions)
  ;; Highlight executable files, but not directories:
  (dired-rainbow-define-chmod executable-unix "#4e9a06" "-.*x.*"))

(use-package diredfl ;; Addtional syntax highlighting for dired
  :elpaca t
  :hook ((dired-mode . diredfl-mode)
         (dirvish-directory-view-mode . diredfl-mode))
  ;; :config
  ;; (set-face-attribute 'diredfl-dir-name nil :bold t)
  )
