roles/emacs/files/README.org
**** COMMENT dired-recent
*I'm not sure that this package is needed, since I already use [[*consult-dir][consult-dir]].*
=C-x C-d= to open ~dired-recent-open~.

#+begin_src emacs-lisp
(use-package dired-recent
  :elpaca t
  :config
  (dired-recent-mode t)
  (define-key dired-recent-mode-map (kbd "C-x C-d") nil)
  )
#+end_src

** Email
*** mu4e
#+begin_src emacs-lisp :noweb yes
(use-package mu4e
  :preface
  (add-to-list 'load-path "~/.nix-profile/share/emacs/site-lisp/mu4e")
  ;; :defer 20 ; Wait until 20 seconds after startup
  :custom
  <<mu4e-custom>>
  :config
  <<mu4e-config>>
  )
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref mu4e-custom
:END:
Use mu4e for e-mail in emacs.
#+begin_src emacs-lisp
(mail-user-agent 'mu4e-user-agent)
#+end_src

#+begin_src emacs-lisp
;; (mu4e-headers-date-format "%Y/%m/%d")
(mu4e-change-filenames-when-moving t)
#+end_src

The one with =:favorite t= will be used for the modeline.
#+begin_src emacs-lisp
(mu4e-bookmarks
 `((:name "Inbox"
          ;; :query ,(string-join '("maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\""
          ;;                        "AND NOT maildir:/anuvyklack@gmail/Архив") " ")
          :query ,(concat "maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\" "
                          "AND NOT maildir:/anuvyklack@gmail/Архив "
                          "AND NOT flag:list ")
          :key ?i
          :favorite t)
   (:name "Mail lists"
          :query ,(concat "flag:list "
                          "AND maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\" ")
          ;; :query ,(concat "flag:list "
          ;;                 "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
          ;;                 "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам")
          :key ?l)
   ;; (:name "Unread messages" :query "flag:unread AND NOT flag:trashed" :key ?u)
   (:name "Today's messages"
          :query ,(concat "date:today..now "
                          "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
                          "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам")
          :key ?t)
   (:name "Last 7 days"
          :query ,(concat "date:7d..now "
                          "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
                          "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам ")
          :hide-unread t :key ?w)
   (:name "Archive" :query "maildir:/anuvyklack@gmail/Архив" :key ?a)
   ;; (:name "Messages with images"
   ;;        :query ,(concat "mime:image/*"
   ;;                        "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
   ;;                        "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам ")
   ;;        :key ?p)
   ))
#+end_src

Note that these folders below must start with =/=.
#+begin_src emacs-lisp
(mu4e-refile-folder "/anuvyklack@gmail/Архив")
;; (mu4e-refile-folder "/anuvyklack@gmail/[Gmail]/Вся почта")
(mu4e-sent-folder   "/anuvyklack@gmail/[Gmail]/Отправленные")
(mu4e-drafts-folder "/anuvyklack@gmail/[Gmail]/Черновики")
(mu4e-trash-folder  "/anuvyklack@gmail/[Gmail]/Корзина")
#+end_src

Setup some handy shortcuts you can quickly switch to your Inbox -- press =ji=
then, when you want archive some messages, move them to the =Архив= folder by
pressing =ma=.
#+begin_src emacs-lisp
(mu4e-maildir-shortcuts
 '((:maildir "/anuvyklack@gmail/[Gmail]/Отправленные" :key ?s)
   (:maildir "/anuvyklack@gmail/Архив"                :key ?a)
   ;; (:maildir "/anuvyklack@gmail/Inbox"                :key ?i)
   (:maildir "/anuvyklack@gmail/[Gmail]/Вся почта"    :key ?A)
   (:maildir "/anuvyklack@gmail/[Gmail]/Корзина"      :key ?t)))
#+end_src

#+begin_src emacs-lisp
(mu4e-headers-fields
 '((:human-date . 12)
   (:flags . 6)
   ;; (:mailing-list . 10)
   (:from . 25)
   (:subject)
   ;; (:thread-subject)
   ))
#+end_src

Don't save message to =Sent Messages=, Gmail/IMAP takes care of this.
#+begin_src emacs-lisp
(mu4e-sent-messages-behavior 'delete)
#+end_src

This is set to ~t~ to avoid mail syncing issues when using =mbsync=. If you use
=offlineimap= this should be set to ~nil~.
#+begin_src emacs-lisp
(mu4e-change-filenames-when-moving t)
#+end_src

Refresh mail using =mbsync= every 10 minutes.
#+begin_src emacs-lisp
(mu4e-update-interval (* 10 60))
#+end_src

This setting allows to re-sync and re-index mail by pressing =u= in evil normal state.
#+begin_src emacs-lisp
(mu4e-get-mail-command "mbsync -a")
#+end_src

Use [[*vertico][vertico]] for completing instead of ido.
#+begin_src emacs-lisp
(mu4e-completing-read-function 'completing-read)
#+end_src

Skip duplicate messages: do not includ more than one in search results.
#+begin_src emacs-lisp
(mu4e-search-skip-duplicates t)
#+end_src

Do not only show the messages that directly match a certain query, but also
include messages that are related to these messages. That is, messages that
belong to the same discussion threads are included in the results, just like
e.g. Gmail does it.
#+begin_src emacs-lisp
(mu4e-search-include-related t)
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref mu4e-config
:END:

#+begin_src emacs-lisp
;; (add-to-list 'mu4e-bookmarks
;;     ;; ':favorite t' i.e, use this one for the modeline
;;    '(:query "maildir:/anuvyklack@gmail/Inbox" :name "Inbox" :key ?i :favorite t))
#+end_src

Not set flag =T= on deletion. Just move to =Trash= folder. [[https://github.com/djcb/mu/issues/1136#issuecomment-1229005006][Source]]
#+begin_src emacs-lisp
(setf (plist-get (alist-get 'trash mu4e-marks) :action)
      (lambda (docid msg target)
        (mu4e--server-move docid (mu4e--mark-check-target target) "-N"))) ; Instead of "+T-N"
#+end_src

***** icons
#+begin_src emacs-lisp
(setq mu4e-use-fancy-chars nil)
#+end_src

Marks for headers. Each is a cons-cell: ~(basic . fancy)~.
#+begin_src emacs-lisp
(setq mu4e-headers-draft-mark     '("D" . "")
      mu4e-headers-flagged-mark   '("F" . "")
      mu4e-headers-new-mark       '("N" . "")
      mu4e-headers-passed-mark    '("P" . "")
      mu4e-headers-replied-mark   '("R" . "")
      mu4e-headers-seen-mark      '("S" . "")
      mu4e-headers-trashed-mark   '("T" . "")
      mu4e-headers-attach-mark    '("a" . "📎")
      mu4e-headers-encrypted-mark '("x" . "")
      mu4e-headers-signed-mark    '("s" . "")
      mu4e-headers-unread-mark    '("u" . "")
      mu4e-headers-list-mark      '("l" . "")
      mu4e-headers-personal-mark  '("p" . "")
      mu4e-headers-calendar-mark  '("c" . ""))
#+end_src

#+begin_src emacs-lisp
;; (setq mu4e-headers-thread-child-prefix           '("├>" . "├─➤ ")
;;       mu4e-headers-thread-last-child-prefix    '("└>" . "└─➤ ")
;;       mu4e-headers-thread-orphan-prefix        '("┬>" . "┬─➤ ")
;;       mu4e-headers-thread-single-orphan-prefix   '("─>" . "──➤ ")
;;       ;; The following two should have the same width.
;;       mu4e-headers-thread-connection-prefix    '("│" . "│ ")
;;       mu4e-headers-thread-blank-prefix           '(" " . " "))
#+end_src

#+begin_src emacs-lisp
(setq mu4e-headers-thread-orphan-prefix        '("◊ " . "◊ ")
      ;; mu4e-headers-thread-single-orphan-prefix '("◊ " . "◊ ")
      mu4e-headers-thread-single-orphan-prefix '("> " . "◊ ")
      mu4e-headers-thread-duplicate-prefix     '("≡ " . "≡ ")
      mu4e-headers-thread-root-prefix          '("□ " . "□ ")
      mu4e-headers-thread-first-child-prefix   '("○ " . "○ ")
      mu4e-headers-thread-child-prefix         '("├╴" . "├╴")
      mu4e-headers-thread-last-child-prefix    '("└╴" . "└╴")
      ;; mu4e-headers-thread-first-child-prefix   '("○ " . "○ ")
      ;; mu4e-headers-thread-child-prefix         '("├>" . "├>")
      ;; mu4e-headers-thread-last-child-prefix    '("└>" . "└>")
      ;; The following two should have the same width.
      mu4e-headers-thread-connection-prefix    '("│ " . "│ ")
      mu4e-headers-thread-blank-prefix         '("  " . "  "))
#+end_src

*** Send emails
#+begin_src emacs-lisp
(use-package smtpmail
  :custom
  (message-send-mail-function 'smtpmail-send-it)
  (starttls-use-gnutls t)
  (smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil)))
  (smtpmail-auth-credentials '(("smtp.gmail.com" 587 "anuvyklack@gmail.com" nil)))
  (smtpmail-default-smtp-server "smtp.gmail.com")
  (smtpmail-smtp-server "smtp.gmail.com")
  (smtpmail-smtp-service 587)

  ;; Don't keep message buffers around.
  (message-kill-buffer-on-exit t))
#+end_src

** Buffers
*** bufler
#+begin_src emacs-lisp
(use-package bufler
  :elpaca t
  :custom
  (bufler-columns '("Name" "Size" "Path"))
  :config
  (setq bufler-filter-buffer-modes (delete 'fundamental-mode bufler-filter-buffer-modes))
  ;; (add-to-list 'bufler-filter-buffer-modes 'org-roam-mode)
  (my/append-to-list 'bufler-filter-buffer-modes
                     '(org-roam-mode
                       ;; magit-status-mode magit-refs-mode magit-log-mode
                       mu4e-main-mode))
  (my/append-to-list 'bufler-filter-buffer-name-regexps
                     '("\\*EGLOT")))
#+end_src

[[*Bufler keybindings][Bufler keybindings]]

*** COMMENT ibuffer
**** ibuffer

#+begin_src emacs-lisp :noweb yes
(use-package ibuffer
  :after projectile
  :custom
  <<ibuffer-custom>>
  :hook
  <<ibuffer-hook>>
  :config
  <<ibuffer-config>>)
#+end_src

