roles/emacs/files/init.el

(use-package mu4e
  :preface
  (add-to-list 'load-path "~/.nix-profile/share/emacs/site-lisp/mu4e")
  ;; :defer 20 ; Wait until 20 seconds after startup
  :custom
  (mail-user-agent 'mu4e-user-agent)
  ;; (mu4e-headers-date-format "%Y/%m/%d")
  (mu4e-change-filenames-when-moving t)
  (mu4e-bookmarks
   `((:name "Inbox"
            ;; :query ,(string-join '("maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\""
            ;;                        "AND NOT maildir:/anuvyklack@gmail/Архив") " ")
            :query ,(concat "maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\" "
                            "AND NOT maildir:/anuvyklack@gmail/Архив "
                            "AND NOT flag:list ")
            :key ?i
            :favorite t)
     (:name "Mail lists"
            :query ,(concat "flag:list "
                            "AND maildir:\"/anuvyklack@gmail/[Gmail]/Вся почта\" ")
            ;; :query ,(concat "flag:list "
            ;;                 "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
            ;;                 "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам")
            :key ?l)
     ;; (:name "Unread messages" :query "flag:unread AND NOT flag:trashed" :key ?u)
     (:name "Today's messages"
            :query ,(concat "date:today..now "
                            "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
                            "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам")
            :key ?t)
     (:name "Last 7 days"
            :query ,(concat "date:7d..now "
                            "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
                            "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам ")
            :hide-unread t :key ?w)
     (:name "Archive" :query "maildir:/anuvyklack@gmail/Архив" :key ?a)
     ;; (:name "Messages with images"
     ;;        :query ,(concat "mime:image/*"
     ;;                        "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Корзина "
     ;;                        "AND NOT maildir:/anuvyklack@gmail/[Gmail]/Спам ")
     ;;        :key ?p)
     ))
  (mu4e-refile-folder "/anuvyklack@gmail/Архив")
  ;; (mu4e-refile-folder "/anuvyklack@gmail/[Gmail]/Вся почта")
  (mu4e-sent-folder   "/anuvyklack@gmail/[Gmail]/Отправленные")
  (mu4e-drafts-folder "/anuvyklack@gmail/[Gmail]/Черновики")
  (mu4e-trash-folder  "/anuvyklack@gmail/[Gmail]/Корзина")
  (mu4e-maildir-shortcuts
   '((:maildir "/anuvyklack@gmail/[Gmail]/Отправленные" :key ?s)
     (:maildir "/anuvyklack@gmail/Архив" 								:key ?a)
     ;; (:maildir "/anuvyklack@gmail/Inbox"                :key ?i)
     (:maildir "/anuvyklack@gmail/[Gmail]/Вся почта"    :key ?A)
     (:maildir "/anuvyklack@gmail/[Gmail]/Корзина"      :key ?t)))
  (mu4e-headers-fields
   '((:human-date . 12)
     (:flags . 6)
     ;; (:mailing-list . 10)
     (:from . 25)
     (:subject)
     ;; (:thread-subject)
     ))
  (mu4e-sent-messages-behavior 'delete)
  (mu4e-change-filenames-when-moving t)
  (mu4e-update-interval (* 10 60))
  (mu4e-get-mail-command "mbsync -a")
  (mu4e-completing-read-function 'completing-read)
  (mu4e-search-skip-duplicates t)
  (mu4e-search-include-related t)
  :config
  ;; (add-to-list 'mu4e-bookmarks
  ;;     ;; ':favorite t' i.e, use this one for the modeline
  ;;    '(:query "maildir:/anuvyklack@gmail/Inbox" :name "Inbox" :key ?i :favorite t))
  (setf (plist-get (alist-get 'trash mu4e-marks) :action)
        (lambda (docid msg target)
          (mu4e--server-move docid (mu4e--mark-check-target target) "-N"))) ; Instead of "+T-N"
  (setq mu4e-use-fancy-chars nil)
  (setq mu4e-headers-draft-mark     '("D" . "")
        mu4e-headers-flagged-mark   '("F" . "")
        mu4e-headers-new-mark       '("N" . "")
        mu4e-headers-passed-mark    '("P" . "")
        mu4e-headers-replied-mark   '("R" . "")
        mu4e-headers-seen-mark      '("S" . "")
        mu4e-headers-trashed-mark   '("T" . "")
        mu4e-headers-attach-mark    '("a" . "📎")
        mu4e-headers-encrypted-mark '("x" . "")
        mu4e-headers-signed-mark    '("s" . "")
        mu4e-headers-unread-mark    '("u" . "")
        mu4e-headers-list-mark      '("l" . "")
        mu4e-headers-personal-mark  '("p" . "")
        mu4e-headers-calendar-mark  '("c" . ""))
  ;; (setq mu4e-headers-thread-child-prefix           '("├>" . "├─➤ ")
  ;;       mu4e-headers-thread-last-child-prefix    '("└>" . "└─➤ ")
  ;;       mu4e-headers-thread-orphan-prefix        '("┬>" . "┬─➤ ")
  ;;       mu4e-headers-thread-single-orphan-prefix   '("─>" . "──➤ ")
  ;;       ;; The following two should have the same width.
  ;;       mu4e-headers-thread-connection-prefix    '("│" . "│ ")
  ;;       mu4e-headers-thread-blank-prefix           '(" " . " "))
  (setq mu4e-headers-thread-orphan-prefix        '("◊ " . "◊ ")
        ;; mu4e-headers-thread-single-orphan-prefix '("◊ " . "◊ ")
        mu4e-headers-thread-single-orphan-prefix '("> " . "◊ ")
        mu4e-headers-thread-duplicate-prefix     '("≡ " . "≡ ")
        mu4e-headers-thread-root-prefix          '("□ " . "□ ")
        mu4e-headers-thread-first-child-prefix   '("○ " . "○ ")
        mu4e-headers-thread-child-prefix         '("├╴" . "├╴")
        mu4e-headers-thread-last-child-prefix    '("└╴" . "└╴")
        ;; mu4e-headers-thread-first-child-prefix   '("○ " . "○ ")
        ;; mu4e-headers-thread-child-prefix         '("├>" . "├>")
        ;; mu4e-headers-thread-last-child-prefix    '("└>" . "└>")
        ;; The following two should have the same width.
        mu4e-headers-thread-connection-prefix    '("│ " . "│ ")
        mu4e-headers-thread-blank-prefix         '("  " . "  "))
  )

(use-package smtpmail
  :custom
  (message-send-mail-function 'smtpmail-send-it)
  (starttls-use-gnutls t)
  (smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil)))
  (smtpmail-auth-credentials '(("smtp.gmail.com" 587 "anuvyklack@gmail.com" nil)))
  (smtpmail-default-smtp-server "smtp.gmail.com")
  (smtpmail-smtp-server "smtp.gmail.com")
  (smtpmail-smtp-service 587)

  ;; Don't keep message buffers around.
  (message-kill-buffer-on-exit t))

(use-package bufler
  :elpaca t
  :custom
  (bufler-columns '("Name" "Size" "Path"))
  :config
  (setq bufler-filter-buffer-modes (delete 'fundamental-mode bufler-filter-buffer-modes))
  ;; (add-to-list 'bufler-filter-buffer-modes 'org-roam-mode)
  (my/append-to-list 'bufler-filter-buffer-modes
                     '(org-roam-mode
                       magit-status-mode magit-refs-mode magit-log-mode
                       mu4e-main-mode)))

(use-package org
  :after evil
  :custom
