roles/emacs/files/README.org
***** custom
:PROPERTIES:
:header-args: :noweb-ref ibuffer-custom
:END:

#+begin_src emacs-lisp
(ibuffer-expert t) ;; Do not ask for confirmation to delete the unmodified buffer.
(ibuffer-truncate-lines t)
(ibuffer-show-empty-filter-groups nil) ;; Don't show emtpy filter groups
(ibuffer-display-summary nil)
;; (ibuffer-read-only-char "%")
;; (ibuffer-modified-char "*")
;; (ibuffer-marked-char ">")
;; (ibuffer-locked-char "L")
;; (ibuffer-deletion-char "D")
;; (ibuffer-formats)
;; (define-ibuffer-column)
(ibuffer-formats '((mark modified read-only locked
                         " "
                         (name 25 25 :left :elide)
                         "   "
                         ;; (filename-and-process 75 -1 :left :elide)
                         (project-relative-filename-or-process 75 -1 :left :elide)
                         " "
                         mode)))
#+end_src

***** hook
:PROPERTIES:
:header-args: :noweb-ref ibuffer-hook
:END:

#+begin_src emacs-lisp
(ibuffer . (lambda ()
             (ibuffer-auto-mode) ;; Automatically update the ibuffer
             (hl-line-mode)
             ;; (setq truncate-lines t) ;; do not wrap long lines
             ;; (ibuffer-switch-to-saved-filter-groups "home")
             ))
#+end_src

***** config
:PROPERTIES:
:header-args: :noweb-ref ibuffer-config
:END:

#+begin_src emacs-lisp
(define-ibuffer-column project-relative-filename-or-process
  (:name "Filename/Process"
         :header-mouse-map ibuffer-filename/process-header-map
         :summarizer
         (lambda (strings)
           (setq strings (delete "" strings))
           (let ((procs 0)
                 (files 0))
             (dolist (string strings)
               (when (get-text-property 1 'ibuffer-process string)
                 (setq procs (1+ procs)))
               (setq files (1+ files)))
             (concat (cond ((zerop files) "No files")
                           ((= 1 files) "1 file")
                           (t (format "%d files" files)))
                     ", "
                     (cond ((zerop procs) "no processes")
                           ((= 1 procs) "1 process")
                           (t (format "%d processes" procs)))))))
  (let ((proc (get-buffer-process buffer))
        (filename (ibuffer-make-column-filename buffer mark)))
    (if proc
        (concat (propertize (format "(%s %s)" proc (process-status proc))
                            'font-lock-face 'italic
                            'ibuffer-process proc)
                (if (> (length filename) 0)
                    (format " %s" filename)
                  ""))
      ;; else
      (let ((root-dir (cdr (ibuffer-projectile-root buffer))))
        (if root-dir
            (file-relative-name filename root-dir)
          (abbreviate-file-name filename)
          ;; filename
          )))))
#+end_src

**** COMMENT all-the-icons-ibuffer

#+begin_src emacs-lisp
(use-package all-the-icons-ibuffer
  :elpaca t
  :after all-the-icons
  :hook (ibuffer-mode . all-the-icons-ibuffer-mode)
  :custom
  (all-the-icons-ibuffer-human-readable-size t))
#+end_src

**** ibuffer-projectile

#+begin_src emacs-lisp
(use-package ibuffer-projectile
  :elpaca t
  :hook (ibuffer . (lambda ()
                     (ibuffer-projectile-set-filter-groups)
                     (unless (eq ibuffer-sorting-mode 'alphabetic)
                       (ibuffer-do-sort-by-alphabetic)))))
#+end_src

** Org-mode
*** org
#+begin_src emacs-lisp :noweb yes
(use-package org
  :after evil
  :custom
  <<org-custom>>
  :config
  <<org-config>>)
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref org-custom
:END:

Sometimes you may inadvertently edit an invisible part of the buffer and be
confused on what has been edited and how to undo the mistake. This setting
allow to preventing this.
#+begin_src emacs-lisp
(org-catch-invisible-edits 'show-and-error)
#+end_src

Turn on ~org-indent-mode~ on startup, which softly indent text according to
outline structure.
#+begin_src emacs-lisp
(org-startup-indented t)
#+end_src

Make ~org-beginning-of-line~ and ~org-end-of-line~ ignore leading stars or
tags on headings. Repeat to toggle.
~evil-org-insert-line~ and ~evil-org-append-line~ also respect this setting.
#+begin_src emacs-lisp
(org-special-ctrl-a/e t)
#+end_src

Прижимать тэги к 80 колонке справа.
#+begin_src emacs-lisp
(org-tags-column -80)
#+end_src

The maximum level for Imenu access to Org headlines.
#+begin_src emacs-lisp
(org-imenu-depth 8)
#+end_src

Show inline images by default in org-mode.
#+begin_src emacs-lisp
(org-startup-with-inline-images t)
#+end_src

#+begin_src emacs-lisp
(org-image-actual-width '(400))
#+end_src

↴ ▼ ▶ ⤵    󱞣
#+begin_src emacs-lisp
;; (org-ellipsis " ")
;; (org-ellipsis " ↴")
(org-ellipsis " ⤵")
#+end_src

Open src block buffer to the right of the current window keeping all other
windows.
#+begin_src emacs-lisp
;; (org-src-window-setup 'split-window-right)
(org-src-window-setup 'current-window) ;; edit in current window
#+end_src

Indentation for the content of a source code block.
#+begin_src emacs-lisp
(org-edit-src-content-indentation 0)
(org-src-preserve-indentation nil)
#+end_src

If non-nil, the effect of =TAB= in a code block is as if it were issued in the
language major mode buffer.
#+begin_src emacs-lisp
(org-src-tab-acts-natively t)
#+end_src

Follow org links by press Enter with point on it.
#+begin_src emacs-lisp
;; (org-return-follows-link t)
#+end_src

Follow org links by press Tab with point on it.
#+begin_src emacs-lisp
;; (org-tab-follows-link t)
#+end_src

#+begin_src emacs-lisp
(org-use-speed-commands nil)
#+end_src

Changes to task states might get logged, especially for recurring
routines. If so, log them in a drawer, not the content of the note.
#+begin_src emacs-lisp
;; (org-log-state-notes-into-drawer t)
#+end_src

Show only description of the link.
#+begin_src emacs-lisp
(org-link-descriptive t)
#+end_src

[[*Applications used to open external files][org-file-apps]]

#+begin_src emacs-lisp
(org-ctrl-k-protect-subtree t)
(org-id-locations-file-relative t)
;; (org-indirect-buffer-display 'current-window)
(org-list-allow-alphabetical t)
(org-log-into-drawer t)
#+end_src

Initial visibility.
#+begin_src emacs-lisp
;; (org-startup-folded 'content)
(org-startup-folded 'show2levels)
#+end_src

Properties apply also for sublevels.
#+begin_src emacs-lisp
(org-use-property-inheritance t)
#+end_src

#+begin_src emacs-lisp
(org-src-tab-acts-natively t)
#+end_src

#+begin_src emacs-lisp
(org-src-fontify-natively t)
(org-fontify-whole-heading-line t)
(org-fontify-done-headline t)
(org-fontify-quote-and-verse-blocks t)
#+end_src

Indentation of the description in definition item.
*Has been removed.*
#+begin_src emacs-lisp
;; (org-list-description-max-indent 20)
#+end_src

#+begin_src emacs-lisp
;; (org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+")))
#+end_src

Additional indentation for sub-items in a list.
#+begin_src emacs-lisp
;; (org-list-indent-offset 1)
#+end_src

Consider plain lists items as a lower level subheadings, during cycling
with =Tab= key.
#+begin_src emacs-lisp
(org-cycle-include-plain-lists 'integrate)
#+end_src

Track time when tasks were finished.
#+begin_src emacs-lisp
(org-log-done 'time)
#+end_src

#+begin_src emacs-lisp
(org-deadline-warning-days 14)
(org-log-redeadline 'note)
(org-log-reschedule nil)
#+end_src

#+begin_src emacs-lisp
(org-agenda-window-setup 'reorganize-frame)
(org-agenda-restore-windows-after-quit t)
#+end_src

Include entries from the Emacs diary into Org mode’s agenda.
#+begin_src emacs-lisp
(org-agenda-include-diary nil)
#+end_src

#+begin_src emacs-lisp
(org-pretty-entities t)
#+end_src

#+begin_src emacs-lisp
;; (org-use-tag-inheritance nil)
;; (org-tags-exclude-from-inheritance '("soft" "cli"))
(org-tags-match-list-sublevels nil)
#+end_src

***** footnotes
#+begin_src emacs-lisp
(org-footnote-define-inline nil)
(org-footnote-auto-adjust t)
#+end_src

***** attachments
#+begin_src emacs-lisp
(org-attach-store-link-p t)
(org-attach-use-inheritance nil)
(org-attach-auto-tag "ATTACH")
#+end_src

***** "TODO" keywords and Priorities
#+begin_src emacs-lisp
(org-todo-keywords '((sequence "󰔌" ;; SOMEDAY
                               "󰒅" ;; SOMEDAY
                               "󰄱" ;; TODO
                               "󱗝" ;; NEXT
                               "󰡖" ;; NEXT
                               "󰤌" ;; IN PROCESS
                               "󱅊" ;; IN PROGRESS
                               "󰔟" ;; WAITING
                               "|"
                               "󰄵" ;; DONE
                               "󱈎" ;; ARCHIVED
                               "󰅘" ;; CANCELLED
                               )
                     (sequence "SOMEDAY" "TODO" "NEXT" "INPROGRESS" "WAITING" "|" "DONE" "ARCHIVED" "CANCELLED")))
#+end_src

Make priority signs be integers from 1 to 5, with 3 as default.
Default priorities are: =#A=, =#B=, =#C=, with =#B= as default.
#+begin_src emacs-lisp
(org-priority-highest ?A)
(org-priority-lowest  ?D) 
(org-priority-default ?C)
#+end_src

***** babel
Allow babel code execution without confirming it every time.
#+begin_src emacs-lisp
(org-confirm-babel-evaluate nil)
#+end_src

Use PlantUML executable instead of =.jar= file together with Java.
#+begin_src emacs-lisp
(org-plantuml-exec-mode 'plantuml)
(org-plantuml-jar-path (expand-file-name "~/.nix-profile/lib/plantuml.jar"))
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref org-config
:END:
***** Applications used to open external files
I set up it config section, but not in custom section, because of bug: the
options just don't set if I set it in use-package =:custom= section.

#+begin_src emacs-lisp
(setq org-file-apps '(("\\.pdf\\'" . "xdg-open %s")
                      ("\\.djvu\\'" . "xdg-open %s")
                      ;; ("\\.pdf\\'" . "evince %s")
                      ("\\.\\(?:jpe?g\\|png\\)\\'" . "xdg-open %s")
                      (auto-mode . emacs)
                      (directory . emacs)
                      ("\\.mm\\'" . default)
                      ("\\.x?html?\\'" . default)))
#+end_src

***** Babel
Setup available embedded languages for babel.

#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages
                             '((sql . t)
                               (shell . t)
                               (emacs-lisp . t)
                               (python . t)
                               (plantuml . t)))
#+end_src

Redisplay images produced by babel after evaluating the block source.
#+begin_src emacs-lisp
(add-hook 'org-babel-after-execute-hook
          (lambda ()
            (when org-inline-image-overlays
              (org-redisplay-inline-images))))
#+end_src

***** Returning convenient paragrapsh behavior in evil
[[https://emacs.stackexchange.com/a/38605][Source]]

Переоределяем понятие =paragraph= в =org-mode= для ряда функций на стандартное:
параграф --- это любой сплошной текст разделённый пустыми линиями.

#+begin_src emacs-lisp
(with-eval-after-load 'evil
  (define-advice forward-evil-paragraph
      (:around (orig-fun &rest args) use-default-paragraph-definiton-in-org)
    (if (derived-mode-p 'org-mode)
        (let ((paragraph-start (default-value 'paragraph-start))
              (paragraph-separate (default-value 'paragraph-separate)))
          (apply orig-fun args))
      (apply orig-fun args))))
#+end_src

***** Fonts and icons
****** COMMENT Font in agenda buffer
#+begin_src emacs-lisp
(defun my/org-setup-agenda-buffer-face ()
  (setq buffer-face-mode-face '(:family "iA Writer Mono S"))
  (buffer-face-mode))

(add-hook 'org-agenda-mode-hook 'my/org-setup-agenda-buffer-face)
#+end_src

