roles/emacs/files/init.el
  (org-catch-invisible-edits 'show-and-error)
  (org-startup-indented t)
  (org-special-ctrl-a/e t)
  (org-tags-column -80)
  (org-imenu-depth 8)
  (org-startup-with-inline-images t)
  (org-image-actual-width '(400))
  ;; (org-ellipsis " ")
  (org-ellipsis " ↴")
  ;; (org-src-window-setup 'split-window-right)
  (org-src-window-setup 'current-window) ;; edit in current window
  (org-edit-src-content-indentation 0)
  (org-src-preserve-indentation nil)
  (org-src-tab-acts-natively t)
  ;; (org-return-follows-link t)
  ;; (org-tab-follows-link t)
  (org-use-speed-commands nil)
  ;; (org-log-state-notes-into-drawer t)
  (org-link-descriptive t)
  (org-ctrl-k-protect-subtree t)
  (org-id-locations-file-relative t)
  ;; (org-indirect-buffer-display 'current-window)
  (org-list-allow-alphabetical t)
  (org-log-into-drawer t)
  ;; (org-startup-folded 'content)
  (org-startup-folded 'show2levels)
  (org-use-property-inheritance t)
  (org-src-tab-acts-natively t)
  (org-confirm-babel-evaluate nil)
  (org-src-fontify-natively t)
  (org-fontify-whole-heading-line t)
  (org-fontify-done-headline t)
  (org-fontify-quote-and-verse-blocks t)
  ;; (org-list-description-max-indent 20)
  ;; (org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+")))
  (org-list-indent-offset 1)
  (org-cycle-include-plain-lists 'integrate)
  ;; (org-todo-keywords '((sequence "TODO" "WAITING" "NEXT" "DOING" "|" "DONE" "CANCELED")))
  ;; (org-todo-keywords '((sequence "TODO" "WAITING" "NEXT" "STARTED" "|" "DONE" "CANCELED")))
  (org-todo-keywords '((sequence "TODO" "WAITING" "NEXT" "INPROGRES" "|" "DONE" "CANCELED")))
  (org-priority-highest 65) ;; A
  (org-priority-lowest 67)  ;; C
  (org-priority-default 67) ;; C
  (org-log-done 'time)
  (org-deadline-warning-days 14)
  (org-log-redeadline 'note)
  (org-log-reschedule nil)
  (org-agenda-window-setup 'reorganize-frame)
  (org-agenda-restore-windows-after-quit t)
  (org-agenda-include-diary nil)
  (org-pretty-entities t)
  (org-attach-store-link-p t)
  (org-attach-use-inheritance t)
  :config
  (setq org-file-apps '(("\\.pdf\\'" . "evince %s")
                        ("\\.djvu\\'" . "evince %s")
                        (auto-mode . emacs)
                        (directory . emacs)
                        ("\\.mm\\'" . default)
                        ("\\.x?html?\\'" . default)))
  (org-babel-do-load-languages 'org-babel-load-languages
                               '((sql . t)
                                 (shell . t)
                                 (emacs-lisp . t)
                                 (python . t)))
  (with-eval-after-load 'evil
    (define-advice forward-evil-paragraph
        (:around (orig-fun &rest args) use-default-paragraph-definiton-in-org)
      (if (derived-mode-p 'org-mode)
          (let ((paragraph-start (default-value 'paragraph-start))
                (paragraph-separate (default-value 'paragraph-separate)))
            (apply orig-fun args))
        (apply orig-fun args))))
  (defun my/org-setup-agenda-buffer-face ()
    (setq buffer-face-mode-face '(:family "iA Writer Mono S"))
    (buffer-face-mode))
  
  (add-hook 'org-agenda-mode-hook 'my/org-setup-agenda-buffer-face)
