roles/emacs/files/README.org
****** Prettify symbols mode
#+begin_src emacs-lisp
(defun my/org-icons ()
  "Beautify org mode keywords."
  (setq prettify-symbols-alist
        (mapcan (lambda (x) (list x (cons (upcase (car x)) (cdr x))))
                '(("#+begin_src" . "")
                  ("#+end_src" . "―")
                  ("#+begin_example" . "")
                  ("#+end_example" . "")
                  ("#+begin_quote" . "")
                  ("#+end_quote" . "")
                  ;; ("#+begin_quote" . "")
                  ;; ("#+end_quote" . "")
                  ;; ("#+header:" . ?)
                  ;; ("#+name:" . ?﮸)
                  ;; ("#+results:" . ?)
                  ;; ("#+call:" . ?)
                  ;; (":properties:" . ?)
                  ;; (":logbook:" . ?)
                  )))
  ;; (setq prettify-symbols-alist '(("TODO" . "")
  ;;                                ("WAIT" . "")
  ;;                                ("NOPE" . "")
  ;;                                ("DONE" . "")
  ;;                                ("[#A]" . "")
  ;;                                ("[#B]" . "")
  ;;                                ("[#C]" . "")
  ;;                                ("[ ]" . "")
  ;;                                ("[X]" . "")
  ;;                                ("[-]" . "")
  ;;                                ;; (":PROPERTIES:" . "")
  ;;                                ;; (":END:" . "―")
  ;;                                ;; ("#+STARTUP:" . "")
  ;;                                ;; ("#+TITLE: " . "")
  ;;                                ;; ("#+RESULTS:" . "")
  ;;                                ;; ("#+NAME:" . "")
  ;;                                ;; ("#+ROAM_TAGS:" . "")
  ;;                                ;; ("#+FILETAGS:" . "")
  ;;                                ;; ("#+HTML_HEAD:" . "")
  ;;                                ;; ("#+SUBTITLE:" . "")
  ;;                                ;; ("#+AUTHOR:" . "")
  ;;                                ;; (":Effort:" . "")
  ;;                                ;; ("SCHEDULED:" . "")
  ;;                                ;; ("DEADLINE:" . "")
  ;;                                ))
  (prettify-symbols-mode))
#+end_src

***** COMMENT Highlight syntax for inline code blocks
[[https://stackoverflow.com/a/62319997][Source]]

#+begin_src emacs-lisp
(defun my/fontify-inline-src-code (limit)
  "Match inline source blocks from point to LIMIT."
  ;; stolen from `org-element-inline-src-block-parser'
  (when (re-search-forward "\\_<src_\\([^ \t\n[{]+\\)[{[]" limit t)
    ;; This especially clarifies that the square brackets are optional.
    (let ((beg (match-beginning 0))
          pt
          (lang-beg (match-beginning 1))
          (lang-end (match-end 1))
          header-args-beg header-args-end
          code-beg code-end)
      (setq pt (goto-char lang-end))
      (when (org-element--parse-paired-brackets ?\[)
        (setq header-args-beg pt
              header-args-end (point)
              pt (point)))
      (when (org-element--parse-paired-brackets ?\{)
        (setq code-beg pt
              code-end (point))
        (set-match-data (list beg (point)
                              beg lang-beg
                              lang-beg
                              lang-end
                              header-args-beg
                              header-args-end
                              code-beg
                              code-end
                              (current-buffer)))
        code-end))))

(defun my/config-fontify-inline-src-code ()
  "Fontify inline source code, such as src_html[:exports code]{<em>to be emphased</em>}."
  (font-lock-add-keywords nil
                          '((my/fontify-inline-src-code
                             (1 '(:foreground "black" :weight normal :height 10) t) ; src_ part
                             (2 '(:foreground "cyan" :weight bold :height 75 :underline "red") t) ; "lang" part.
                             (3 '(:foreground "#555555" :height 70) t) ; [:header arguments] part.
                             (4 'org-code t) ; "code..." part.
                             ))
                          'append))

(add-hook 'org-mode-hook #'my/config-fontify-inline-src-code)
#+end_src

*** APPEARENCE
**** org-superstar
#+begin_src emacs-lisp
(use-package org-superstar
  :elpaca t
  :after org
  :custom
  (org-superstar-remove-leading-stars nil)
  (org-superstar-headline-bullets-list '("●"))
  ;; (org-superstar-leading-bullet)
  (org-superstar-item-bullet-alist '(;;(?- . ?•)
                                     (?* . ?‣)))
  :hook (org-mode . org-superstar-mode))
#+end_src

**** org-pretty-tags
#+begin_src emacs-lisp
(use-package org-pretty-tags
  :elpaca t
  :hook (org-mode . org-pretty-tags-mode)
  :custom
  (org-pretty-tags-surrogate-strings '(("ATTACH" . "  󰁦  "))))
#+end_src

**** COMMENT org-fancy-priorities
   █
⬢ ⬣ ⯀ ⯁
#+begin_src emacs-lisp
(use-package org-fancy-priorities
  :elpaca t
  :hook (org-mode . org-fancy-priorities-mode)
  :custom
  ;; (org-fancy-priorities-list '("🟥" "🟧" "🟨" "🟩" "🟦" "🟪"))
  ;; (org-fancy-priorities-list '("" "" ""))
  ;; (org-fancy-priorities-list '("" "" ""))
  ;; (org-fancy-priorities-list '("█" "█" "█"))
  ;; (org-fancy-priorities-list '("⯀" "⯀" "⯀"))
  ;; (org-fancy-priorities-list '("⬢" "⬢" "⬢"))
  ;; (org-fancy-priorities-list '("⬣" "⬣" "⬣"))
  (org-priority-faces
   '((?A :foreground "red" :weight bold)
     ;; (?B :foreground "orange" :weight bold)
     (?B :foreground "#FFCC32" :weight bold)
     (?C :foreground "#7CB342" :weight bold)))
  )
#+end_src

**** COMMENT org-modern
#+begin_src emacs-lisp
(use-package org-modern
  :elpaca t
  :after org
  :hook ((org-mode . org-modern-mode)
         (org-agenda-finalize . org-modern-agenda)))
#+end_src

**** COMMENT svg-tag-mode
#+begin_src emacs-lisp
(use-package svg-tag-mode
  :elpaca t
  :config
  (setq svg-tag-tags
        '(
          ;; ("\\(:[A-Za-z0-9_]+\\)" . ((lambda (tag)
          ;;                          (svg-tag-make tag :beg 1))))
          ;; ("\\(:[A-Za-z0-9_]+:\\)$" . ((lambda (tag)
          ;;                            (svg-tag-make tag :beg 1 :end -1))))))

          ;; Progress
          ;; ("\\(\\[[0-9]\\{1,3\\}%\\]\\)" . ((lambda (tag)
          ;;                             (svg-progress-percent (substring tag 1 -2)))))
          ("\\(\\[[0-9]+/[0-9]+\\]\\)" . ((lambda (tag)
                                      (svg-progress-count (substring tag 1 -1)))))

          ;; ;; Citation of the form [cite:@Knuth:1984]
          ;; ("\\(\\[cite:@[A-Za-z]+:\\)" . ((lambda (tag)
          ;;                              (svg-tag-make tag
          ;;                                            :inverse t
          ;;                                            :beg 7 :end -1
          ;;                                            :crop-right t))))
          ;; ("\\[cite:@[A-Za-z]+:\\([0-9]+\\]\\)" . ((lambda (tag)
          ;;                                      (svg-tag-make tag
          ;;                                                    :end -1
          ;;                                                    :crop-left t))))

          ;; ;; Active date (with or without day name, with or without time)
          ;; (,(format "\\(<%s>\\)" date-re) .
          ;;  ((lambda (tag)
          ;;     (svg-tag-make tag :beg 1 :end -1 :margin 0))))
          ;; (,(format "\\(<%s \\)%s>" date-re day-time-re) .
          ;;  ((lambda (tag)
          ;;     (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0))))
          ;; (,(format "<%s \\(%s>\\)" date-re day-time-re) .
          ;;  ((lambda (tag)
          ;;     (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0))))
          ;; 
          ;; ;; Inactive date  (with or without day name, with or without time)
          ;; (,(format "\\(\\[%s\\]\\)" date-re) .
          ;;  ((lambda (tag)
          ;;     (svg-tag-make tag :beg 1 :end -1 :margin 0 :face 'org-date))))
          ;; (,(format "\\(\\[%s \\)%s\\]" date-re day-time-re) .
          ;;  ((lambda (tag)
          ;;     (svg-tag-make tag :beg 1 :inverse nil :crop-right t :margin 0 :face 'org-date))))
          ;; (,(format "\\[%s \\(%s\\]\\)" date-re day-time-re) .
          ;;  ((lambda (tag)
          ;;     (svg-tag-make tag :end -1 :inverse t :crop-left t :margin 0 :face 'org-date)))))
        )))
#+end_src

**** COMMENT org-link-beautify
#+begin_src emacs-lisp
(use-package org-link-beautify
  :elpaca t
  :config
  (org-link-beautify-mode))
#+end_src

**** COMMENT org-tag-beautify
#+begin_src emacs-lisp
(use-package org-tag-beautify
  :elpaca t
  :custom (org-tag-beautify-data-dir "~/Code/Emacs/org-tag-beautify/data/")
  :init
  (org-tag-beautify-add-tags-to-list)
  (org-tag-beautify-mode 1))
#+end_src

*** org-roam
**** org-roam
#+begin_src emacs-lisp :noweb yes
(use-package org-roam
  :elpaca t
  :after org
  :init
  (when (version<= "29" emacs-version)
    (setq org-roam-database-connector 'sqlite-builtin))
  :custom
  <<org-roam-custom>>
  :config
  <<org-roam-config>>
  )
#+end_src
***** custom
:PROPERTIES:
:header-args: :noweb-ref org-roam-custom
:END:
#+begin_src emacs-lisp
(org-roam-directory (file-truename "~/notes"))
#+end_src

Provide link completion matching outside of Org links.
#+begin_src emacs-lisp
(org-roam-completion-everywhere t)
#+end_src

How to store link on org-mode outline node:
- t            :: Create an ID if needed to make a link to the current entry.
- use-exixting :: Use existing ID, do not create one.
#+begin_src emacs-lisp
;; (org-id-link-to-org-use-id 'create-if-interactive)
(org-id-link-to-org-use-id 'use-existing)
#+end_src

Make =org-roam= snappier during sqlite database synchronization.
#+begin_src emacs-lisp
(org-roam-db-gc-threshold most-positive-fixnum)
#+end_src

Set a more informative completion interface, for vertico.
#+begin_src emacs-lisp
(org-roam-node-display-template (concat "${title:*} "
                                        (propertize "${tags:17}" 'face 'org-tag)))
#+end_src

***** config
:PROPERTIES:
:header-args: :noweb-ref org-roam-config
:END:

#+begin_src emacs-lisp
(org-roam-db-autosync-mode)
#+end_src

#+begin_src emacs-lisp
(add-to-list 'org-default-properties "ROAM_EXCLUDE")
#+end_src

#+begin_src emacs-lisp
;; (add-to-list 'display-buffer-alist
;;              '("\\*org-roam\\*"
;;                (display-buffer-in-direction)
;;                (direction . right)
;;                (window-width . 0.33)
;;                (window-height . fit-window-to-buffer)))
#+end_src

***** functions
:PROPERTIES:
:header-args: :noweb-ref org-roam-config
:END:
****** Insert node immediate
#+begin_src emacs-lisp
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))
#+end_src

****** Create untracked node
#+begin_src emacs-lisp
(defun org-roam-create-untracked-node ()
  "Create Org-Roam node with `ROAM_EXCLUDE' property."
  (interactive)
  (org-id-get-create)
  (org-set-property "ROAM_EXCLUDE" "t"))
#+end_src

**** org-roam-dailies
#+begin_src emacs-lisp
(use-package org-roam-dailies
  :after org-roam
  :custom
  (org-roam-dailies-directory "journal/")
  ;; (org-roam-dailies-capture-templates
  ;;  '(("d" "default" entry "* %<%I:%M %p>: %?"
  ;;     :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  )
#+end_src

**** consult-org-roam
#+begin_src emacs-lisp :noweb yes
(use-package consult-org-roam
  :elpaca t
  :after org-roam
  :custom
  <<consult-org-roam-custom>>
  :config
  (consult-org-roam-mode 1))
#+end_src
