roles/emacs/files/init.el
  (defun my/org-icons ()
    "Beautify org mode keywords."
    (setq prettify-symbols-alist
          (mapcan (lambda (x) (list x (cons (upcase (car x)) (cdr x))))
                  '(("#+begin_src" . "")
                    ("#+end_src" . "―")
                    ("#+begin_example" . "")
                    ("#+end_example" . "")
                    ("#+begin_quote" . "")
                    ("#+end_quote" . "")
                    ;; ("#+begin_quote" . "")
                    ;; ("#+end_quote" . "")
                    ;; ("#+header:" . ?)
                    ;; ("#+name:" . ?﮸)
                    ;; ("#+results:" . ?)
                    ;; ("#+call:" . ?)
                    ;; (":properties:" . ?)
                    ;; (":logbook:" . ?)
                    )))
    ;; (setq prettify-symbols-alist '(("TODO" . "")
    ;;                                ("WAIT" . "")
    ;;                                ("NOPE" . "")
    ;;                                ("DONE" . "")
    ;;                                ("[#A]" . "")
    ;;                                ("[#B]" . "")
    ;;                                ("[#C]" . "")
    ;;                                ("[ ]" . "")
    ;;                                ("[X]" . "")
    ;;                                ("[-]" . "")
    ;;                                ;; (":PROPERTIES:" . "")
    ;;                                ;; (":END:" . "―")
    ;;                                ;; ("#+STARTUP:" . "")
    ;;                                ;; ("#+TITLE: " . "")
    ;;                                ;; ("#+RESULTS:" . "")
    ;;                                ;; ("#+NAME:" . "")
    ;;                                ;; ("#+ROAM_TAGS:" . "")
    ;;                                ;; ("#+FILETAGS:" . "")
    ;;                                ;; ("#+HTML_HEAD:" . "")
    ;;                                ;; ("#+SUBTITLE:" . "")
    ;;                                ;; ("#+AUTHOR:" . "")
    ;;                                ;; (":Effort:" . "")
    ;;                                ;; ("SCHEDULED:" . "")
    ;;                                ;; ("DEADLINE:" . "")
    ;;                                ))
    (prettify-symbols-mode)))

(use-package org-roam
  :elpaca t
  :after org
  :init
  (when (version<= "29" emacs-version)
    (setq org-roam-database-connector 'sqlite-builtin))
  :custom
  (org-roam-directory (file-truename "~/notes"))
  (org-roam-completion-everywhere t)
  ;; (org-id-link-to-org-use-id 'create-if-interactive)
  (org-id-link-to-org-use-id 'use-existing)
  (org-roam-db-gc-threshold most-positive-fixnum)
  (org-roam-node-display-template (concat "${title:*} "
                                          (propertize "${tags:17}" 'face 'org-tag)))
  :config
  (org-roam-db-autosync-mode)
  ;; (add-to-list 'display-buffer-alist
  ;;              '("\\*org-roam\\*"
  ;;                (display-buffer-in-direction)
  ;;                (direction . right)
  ;;                (window-width . 0.33)
  ;;                (window-height . fit-window-to-buffer)))
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (cons arg args))
          (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                    '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))
  )

(use-package org-roam-dailies
  :after org-roam
  :custom
  (org-roam-dailies-directory "journal/")
  ;; (org-roam-dailies-capture-templates
  ;;  '(("d" "default" entry "* %<%I:%M %p>: %?"
  ;;     :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  )
