roles/emacs/files/README.org
***** custom
:PROPERTIES:
:header-args: :noweb-ref consult-org-roam-custom
:END:

Use =ripgrep= for searching with ~consult-org-roam-search~.
#+begin_src emacs-lisp
(consult-org-roam-grep-func #'consult-ripgrep)
#+end_src

Configure a custom narrow key for ~consult-buffer~.
#+begin_src emacs-lisp
(consult-org-roam-buffer-narrow-key ?r)
#+end_src

Display org-roam buffers right after non-org-roam buffers in ~consult-buffer~
(and not down at the bottom).
#+begin_src emacs-lisp
;; (consult-org-roam-buffer-after-buffers t)
#+end_src

*** COMMENT consult-notes
#+begin_src emacs-lisp
(use-package consult-notes
  :elpaca t
  :custom
  (consult-notes-org-roam-show-file-size nil)
  ;; :commands (consult-notes
  ;;            consult-notes-search-in-all-notes
  ;;            ;; if using org-roam
  ;;            consult-notes-org-roam-find-node
  ;;            consult-notes-org-roam-find-node-relation)
  :config
  ;; (setq consult-notes-file-dir-sources '(("Name" ?k ey "path/to/dir"))) ;; Set notes dir(s), see below
  ;; ;; Set org-roam integration, denote integration, or org-heading integration e.g.:
  ;; (setq consult-notes-org-headings-files '("~/path/to/file1.org"
  ;;                                          "~/path/to/file2.org"))
  ;; (consult-notes-org-headings-mode)
  (consult-notes-org-roam-mode))
#+end_src

*** org-contrib
#+begin_src emacs-lisp
(use-package org-contrib
  :elpaca t
  :config
  (use-package org-eldoc
    ;; :config (org-eldoc-load)
    ))
#+end_src

*** org-agenda
**** Customize variables
#+begin_src emacs-lisp
(setq org-agenda-skip-scheduled-if-done nil
      org-agenda-skip-deadline-if-done nil
      org-agenda-include-deadlines t
      org-agenda-include-diary nil
      org-agenda-block-separator 61
      org-agenda-compact-blocks nil
      org-agenda-start-with-log-mode nil)
#+end_src

#+begin_src emacs-lisp
(setq org-agenda-prefix-format '((agenda . " %i %-14:c%?-12t% s")
                                 (todo   . " %i %-14:c")
                                 (tags   . " %i %-14:c")
                                 (search . " %i %-14:c")))
#+end_src

**** org-super-agenda
#+begin_src emacs-lisp
(use-package org-super-agenda
  :elpaca t
  ;; :after (org evil-org org-agenda)
  ;; :hook (org-agenda-mode . org-super-agenda-mode)
  :config
  (org-super-agenda-mode)
  ;; Fix problem with evil keybindings in org-super-agenda-mode.
  ;; https://github.com/alphapapa/org-super-agenda/issues/50#issuecomment-817432643
  (setq org-super-agenda-header-map nil))
#+end_src

**** Custom org-agenda commmands
#+begin_src emacs-lisp :noweb yes
(setq my/org-super-agenda-groups
      '((:name "Important"
               :priority "A"
               :tag ("money" "bills")
               :property "urgent")
        (:name "Overdue"
               :deadline past
               :order 2)
        (:name "Due Today"
               :deadline today
               :order 3)
        (:name "Current Taks"
               :todo "NEXT"
               :order 4)
        (:name "Personal"
               :habit t
               :tag "personal"
               :order 6)
        (:name "Projects"
               :tag "PROJECT"
               :order 6)
        (:name "House"
               :category "house"
               :tag "house"
               :order 6)
        (:name "Subaru"
               :category "car"
               :tag ("car" "subaru")
               :order 6)
        (:name "Github"
               :category "issue"
               :tag "issue"
               :order 12)))

(setq org-agenda-custom-commands
      '(("n" "Agenda and all TODOs"
         (;; (agenda "" ((org-agenda-span 7)
          ;;             (org-super-agenda-groups
          ;;              '((:name "Today"
          ;;                       :time-grid t
          ;;                       :date today
          ;;                       :todo "TODAY"
          ;;                       :scheduled today
          ;;                       :order 1)
          ;;                (:discard (:anything t))))))
          (agenda "" ((org-super-agenda-groups nil)))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups my/org-super-agenda-groups)))))
        ("g" "Custom list of all TODO entries"
         ((alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups my/org-super-agenda-groups)))))))
#+end_src

*** org-tempo
Org 9.2 introduced a new template expansion mechanism, combining
~org-insert-structure-template~ bound to =C-c C-,= (my binding is =z,=).
The previous ~easy-templates~ mechanism (=<s Tab=) should be enabled manualy.
For more information, refer to the commentary section in ‘org-tempo.el’.

Type =<se Tab= to insert emacs-lisp source code block.
And type =<sh Tab= to insert bash source block.

#+begin_src emacs-lisp
(use-package org-tempo
  :after org
  :config
  (add-to-list 'org-structure-template-alist '("se" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("sc" . "src cpp"))
  (add-to-list 'org-structure-template-alist '("sp" . "src python"))
  (add-to-list 'org-structure-template-alist '("sl" . "src lua"))
  (add-to-list 'org-structure-template-alist '("sf" . "src fennel"))
  (add-to-list 'org-structure-template-alist '("sr" . "src rust")))
#+end_src

*** org-inlinetask
#+begin_src emacs-lisp
(use-package org-inlinetask
  :after org
  :custom
  (org-cycle-max-level 14)
  (org-inlinetask-min-level 15))
#+end_src

*** org-ql
#+begin_src emacs-lisp
(use-package org-ql
  :elpaca t)
#+end_src

*** org-appear
#+begin_src emacs-lisp
(use-package org-appear
  :elpaca t
  :after org
  :custom
  (org-hide-emphasis-markers t)
  :hook (org-mode . org-appear-mode))
#+end_src

*** org-cliplink
#+begin_src emacs-lisp
(use-package org-cliplink
  :elpaca t)
#+end_src

*** org-roam-ui
#+begin_src emacs-lisp
(use-package org-roam-ui
  :elpaca t
  :after org-roam
  :custom
  (org-roam-ui-sync-theme t)
  (org-roam-ui-follow t)
  (org-roam-ui-update-on-save t)
  (org-roam-ui-follow-mode t)
  (org-roam-ui-open-on-start nil))
#+end_src

*** org-transclusion
#+begin_src emacs-lisp
(use-package org-transclusion
  :elpaca t
  :after evil-collection
  :config
  (set-face-attribute 'org-transclusion-fringe nil :foreground "green" :background "green")
  ;; (set-face-attribute 'org-transclusion-source-fringe nil :foreground "green" :background "green")
  )
#+end_src

*** org-auto-tangle
#+begin_src emacs-lisp
(use-package org-auto-tangle
  :elpaca t
  :defer t
  :custom (org-auto-tangle-babel-safelist '("~/.config/emacs/README.org"))
  :hook (org-mode . org-auto-tangle-mode))
#+end_src

** LaTeX
*** AUCTeX
#+begin_src emacs-lisp
(use-package tex
  :elpaca auctex
  :init
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil))
#+end_src

*** xenops
[[https://github.com/dandavison/xenops][Source]]
#+begin_src emacs-lisp
(use-package xenops
  :elpaca t
  :init
  (setq xenops-math-image-scale-factor 1.4)
  (setq xenops-cache-directory (expand-file-name "var/xenops"
                                                 user-emacs-directory))
  :hook
  (latex-mode . xenops-mode)
  (LaTeX-mode . xenops-mode)
  ;; (org-mode . xenops-mode)
  (xenops-mode . (lambda ()
                   (advice-remove 'org-fill-paragraph
                                  #'xenops-math-fill-paragraph-after-advice))))
#+end_src

** Documents
*** pdf
**** pdf-tools
#+begin_src emacs-lisp
(use-package pdf-tools
  :elpaca t
  :config
  (pdf-loader-install))
#+end_src

**** org-pdftools
Add support for org links from pdftools buffer.

#+begin_src emacs-lisp
(use-package org-pdftools
  :elpaca t
  :hook ((org-mode . org-pdftools-setup-link)
         (pdf-view-mode . org-pdftools-setup-link)))
#+end_src

*** epub (nov.el)
#+begin_src emacs-lisp
(use-package nov
  :elpaca t
  :custom
  (nov-text-width 80)
  :hook
  (nov-mode . visual-line-mode)
  (nov-mode . visual-fill-column-mode)
  :config
  (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))
#+end_src

*** fb2-reader
#+begin_src emacs-lisp
(use-package fb2-reader
  :elpaca t
  :mode ("\\.fb2\\(\\.zip\\)?\\'" . fb2-reader-mode)
  :commands (fb2-reader-continue)
  :custom
  ;; This mode renders book with fixed width, adjust to your preferences.
  (fb2-reader-page-width 80)
  (fb2-reader-image-max-width 400)
  (fb2-reader-image-max-height 400))
#+end_src

*** COMMENT djvu
#+begin_src emacs-lisp
(use-package djvu
  :elpaca t)
#+end_src

** Modeline
*** doom-modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :elpaca t
  ;; :elpaca (:host github :repo "seagle0128/doom-modeline"
  ;;                ;; :ref "aa0e2dd"
  ;;                :ref "379b45bffe7d67683f17c3e815797a082d8793d3")
  :custom
  (doom-modeline-height 27)
  (doom-modeline-buffer-file-name-style 'relative-from-project)
  (doom-modeline-icon t)
  (doom-modeline-major-mode-icon t)
  (doom-modeline-time-icon t)
  (doom-modeline-highlight-modified-buffer-name nil)
  :init
  (setq doom-modeline-support-imenu t)
  :config
  (doom-modeline-mode 1))
#+end_src

** Extra tools
*** telega
#+begin_src emacs-lisp :noweb yes
(use-package telega
  :elpaca t
  :defer t
  :custom
  <<telega-custom>>)
#+end_src
