roles/emacs/files/init.el

(use-package org-contrib
  :elpaca t
  :config
  (use-package org-eldoc
    ;; :config (org-eldoc-load)
    ))

(setq org-agenda-skip-scheduled-if-done nil
      org-agenda-skip-deadline-if-done nil
      org-agenda-include-deadlines t
      org-agenda-include-diary nil
      org-agenda-block-separator 61
      org-agenda-compact-blocks nil
      org-agenda-start-with-log-mode nil)

(setq org-agenda-prefix-format '((agenda . " %i %-14:c%?-12t% s")
                                 (todo . " %i %-14:c")
                                 (tags . " %i %-14:c")
                                 (search . " %i %-14:c")))

(use-package org-super-agenda
  :elpaca t
  ;; :after (org evil-org org-agenda)
  ;; :hook (org-agenda-mode . org-super-agenda-mode)
  :config
  (org-super-agenda-mode)
  ;; Fix problem with evil keybindings in org-super-agenda-mode.
  ;; https://github.com/alphapapa/org-super-agenda/issues/50#issuecomment-817432643
  (setq org-super-agenda-header-map nil))

(setq my/org-super-agenda-groups
      '((:name "Important"
               :priority "A"
               :tag ("money" "bills")
               :property "urgent")
        (:name "Overdue"
               :deadline past
               :order 2)
        (:name "Due Today"
               :deadline today
               :order 3)
        (:name "Current Taks"
               :todo "NEXT"
               :order 4)
        (:name "Personal"
               :habit t
               :tag "personal"
               :order 6)
        (:name "House"
               :category "house"
               :tag "house"
               :order 6)
        (:name "Subaru"
               :tag ("car" "subaru")
               :category "car"
               :order 6)
        (:name "Github"
               :tag "issue"
               :order 12)))

(setq org-agenda-custom-commands
      '(("n" "Agenda and all TODOs"
         (;; (agenda "" ((org-agenda-span 7)
          ;;             (org-super-agenda-groups
          ;;              '((:name "Today"
          ;;                       :time-grid t
          ;;                       :date today
          ;;                       :todo "TODAY"
          ;;                       :scheduled today
          ;;                       :order 1)
          ;;                (:discard (:anything t))))))
          (agenda "" ((org-super-agenda-groups nil)))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups my/org-super-agenda-groups)))))
        ("g" "Custom list of all TODO entries"
         ((alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups my/org-super-agenda-groups)))))))

(use-package org-fancy-priorities
  :elpaca t
  :hook (org-mode . org-fancy-priorities-mode)
  :custom
  ;; (org-fancy-priorities-list '("🟥" "🟧" "🟨" "🟩" "🟦" "🟪"))
  ;; (org-fancy-priorities-list '("" "" ""))
  (org-fancy-priorities-list '("" "" ""))
  ;; (org-fancy-priorities-list '("█" "█" "█"))
  ;; (org-fancy-priorities-list '("⯀" "⯀" "⯀"))
  ;; (org-fancy-priorities-list '("⬢" "⬢" "⬢"))
  ;; (org-fancy-priorities-list '("⬣" "⬣" "⬣"))
  (org-priority-faces
   '((?A :foreground "red" :weight bold)
     (?B :foreground "orange" :weight bold)
     (?C :foreground "Chartreuse3" :weight bold)))
  )

(use-package org-superstar
  :elpaca t
  :after org
  :custom
  (org-superstar-remove-leading-stars nil)
  (org-superstar-item-bullet-alist nil)
  (org-superstar-item-bullet-alist '(;; (?+ . ?●)
                                     ;; (?- . ?•)
                                     (?* . ?➤)))
  :hook (org-mode . org-superstar-mode))

(use-package org-tempo
  :after org
  :config
  (add-to-list 'org-structure-template-alist '("se" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("sc" . "src cpp"))
  (add-to-list 'org-structure-template-alist '("sp" . "src python"))
  (add-to-list 'org-structure-template-alist '("sl" . "src lua"))
  (add-to-list 'org-structure-template-alist '("sf" . "src fennel"))
  (add-to-list 'org-structure-template-alist '("sr" . "src rust")))

(use-package org-inlinetask
  :after org
  :custom
  (org-cycle-max-level 14)
  (org-inlinetask-min-level 15))

(use-package org-ql
  :elpaca t)

(use-package org-appear
  :elpaca t
  :after org
  :custom
  (org-hide-emphasis-markers t)
  :hook (org-mode . org-appear-mode))

(use-package org-cliplink
  :elpaca t)

(use-package org-roam-ui
  :elpaca t
  :after org-roam
  :custom
  (org-roam-ui-sync-theme t)
  (org-roam-ui-follow t)
  (org-roam-ui-update-on-save t)
  (org-roam-ui-follow-mode t)
  (org-roam-ui-open-on-start nil))

(use-package org-transclusion
  :elpaca t
  :after evil-collection
  :config
  (set-face-attribute 'org-transclusion-fringe nil :foreground "green" :background "green")
  ;; (set-face-attribute 'org-transclusion-source-fringe nil :foreground "green" :background "green")
  )

(use-package org-auto-tangle
  :elpaca t
  :defer t
  :custom
  (org-auto-tangle-babel-safelist '("~/.config/emacs/README.org"))
  :hook (org-mode . org-auto-tangle-mode))

(use-package tex
  :elpaca auctex
  :init
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil))

(use-package xenops
  :elpaca t
  :init
  (setq xenops-math-image-scale-factor 1.4)
  (setq xenops-cache-directory (expand-file-name "var/xenops"
                                                 user-emacs-directory))
  :hook
  (latex-mode . xenops-mode)
  (LaTeX-mode . xenops-mode)
  ;; (org-mode . xenops-mode)
  (xenops-mode . (lambda ()
                   (advice-remove 'org-fill-paragraph
                                  #'xenops-math-fill-paragraph-after-advice))))

(use-package doom-modeline
  :elpaca t
  ;; :elpaca (:host github :repo "seagle0128/doom-modeline"
  ;;                ;; :ref "aa0e2dd"
  ;;                :ref "379b45bffe7d67683f17c3e815797a082d8793d3")
  :custom
  (doom-modeline-height 30)
  (doom-modeline-buffer-file-name-style 'relative-from-project)
  (doom-modeline-icon t)
  (doom-modeline-major-mode-icon t)
  (doom-modeline-time-icon t)
  (doom-modeline-highlight-modified-buffer-name nil)
  :init
  (setq doom-modeline-support-imenu t)
  :config
  (doom-modeline-mode 1))

(use-package telega
  :elpaca t
  :defer t
  :custom
