roles/emacs/files/README.org
**** custom
:PROPERTIES:
:header-args: :noweb-ref telega-custom
:END:

#+begin_src emacs-lisp
(telega-directory (file-truename "~/.local/share/telega"))
#+end_src

Telega uses Ido completing read function instead of the default one (that the
user prefers). [[https://github.com/zevlg/telega.el/issues/358#issuecomment-1126650770][Source]]
#+begin_src emacs-lisp
(telega-completing-read-function completing-read-function)
#+end_src

*** pocket-reader
#+begin_src emacs-lisp
(use-package pocket-reader
  :elpaca t)
#+end_src

** Evil mode
*** evil
#+begin_src emacs-lisp :noweb yes
(use-package evil
  :elpaca t
  :init
  (setq-default evil-want-keybinding nil)
  :custom
  <<evil-custom>>
  :config
  <<evil-config>>)
#+end_src
**** custom
:PROPERTIES:
:header-args: :noweb-ref evil-custom
:END:

Need for evil-collection.
#+begin_src emacs-lisp
(evil-want-integration t)
(evil-want-keybinding nil)
#+end_src

#+begin_src emacs-lisp
(evil-want-C-u-scroll t)
(evil-want-C-d-scroll t)
(evil-want-C-i-jump t)
;; (evil-want-minibuffer t)
#+end_src

#+begin_src emacs-lisp
(evil-want-fine-undo t)
(evil-undo-system 'undo-redo)
#+end_src

#+begin_src emacs-lisp
(evil-overriding-maps nil)
;; (evil-search-module 'evil-search)
(evil-move-beyond-eol t)
;; (evil-ex-complete-emacs-commands 'always)
(evil-shift-round t)
(org-return-follows-link t)
#+end_src

#+begin_src emacs-lisp
(evil-vsplit-window-right t)
(evil-split-window-below t)
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref evil-config
:END:

Make =Y= work as =y$=.
Set it here explicitly, because it doesn't work in =custom= section.
#+begin_src emacs-lisp
(customize-set-variable 'evil-want-Y-yank-to-eol t)
#+end_src

#+begin_src emacs-lisp
;; (evil-select-search-module 'evil-search-module 'evil-search)
(evil-select-search-module 'evil-search-module 'isearch)
#+end_src

Bind =:ls= command to +ibuffer+ =bufler= instead of =list-buffers=.

#+begin_src emacs-lisp
;; (evil-ex-define-cmd "ls" 'ibuffer-jump)
(evil-ex-define-cmd "ls" 'bufler)
#+end_src

#+begin_src emacs-lisp
(evil-mode 1)
#+end_src

#+begin_src emacs-lisp
;; (advice-add :after 'evil-window-vsplit)
#+end_src

#+begin_src emacs-lisp
(evil-define-command my/evil-save-modified-buffer-and-kill-it (file &optional bang)
  "Save the current buffer and kill it."
  :repeat nil
  (interactive "<f><!>")
  (when (buffer-modified-p)
    (evil-write nil nil nil file bang))
  (kill-this-buffer)
  ;; (ibuffer)
  (bufler))
#+end_src

*** evil-collection
#+begin_src emacs-lisp :noweb yes
(use-package evil-collection
  :elpaca t
  :after evil
  :custom
  ;; SPC is my leader key, so forbid evil-collection to bind to it.
  (evil-collection-key-blacklist '("SPC"))
  (evil-collection-outline-bind-tab-p t)
  (evil-collection-setup-minibuffer t)
  (evil-collection-corfu-key-themes '(default tab-n-go))
  :config
  (evil-collection-init)
  <<evil-collection-keybindings>>)
#+end_src

*** evil-nerd-commenter
Use =gc{motion}= to comment target and =gcc= to comment line.

/Alternative keybinding could be =z;{motion}=./

#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :elpaca t
  :after evil
  :custom
  (evilnc-comment-text-object "c")
  :config
  (general-def
    :states 'motion
    "g c" 'evilnc-comment-operator))
#+end_src

*** evil-visualstar
Make =*= work with visual selection.

#+begin_src emacs-lisp
(use-package evil-visualstar
  :elpaca t
  :after evil
  :config (global-evil-visualstar-mode))
#+end_src

*** evil-goggles
#+begin_src emacs-lisp :noweb yes
(use-package evil-goggles
  :elpaca t
  :after evil
  :custom
  ;; (evil-goggles-duration 0.100) ;; default is 0.200
  (evil-goggles-enable-delete nil)
  ;; (evil-goggles-enable-change nil)
  :config
  <<evil-goggles-config>>)
#+end_src
**** config
:PROPERTIES:
:header-args: :noweb-ref evil-goggles-config
:END:

#+begin_src emacs-lisp
(evil-goggles-mode)
#+end_src

Optionally use diff-mode's faces; as a result, deleted text will be highlighed
with ~diff-removed~ face which is typically some red color (as defined by the
color theme). Other faces such as ~diff-added~ will be used for other actions.

#+begin_src emacs-lisp
(evil-goggles-use-diff-faces)
#+end_src

*** evil-matchit
#+begin_src emacs-lisp
(use-package evil-matchit
  :elpaca t
  :after evil
  :config (global-evil-matchit-mode 1))
#+end_src

*** evil-surround
#+begin_src emacs-lisp
(use-package evil-surround
  :elpaca t
  :after evil
  :config (global-evil-surround-mode 1))
#+end_src

*** evil-easymotion
#+begin_src emacs-lisp
(use-package evil-easymotion
  :elpaca t
  :after (avy evil)
  :config
  (evil-define-avy-motion avy-goto-word-0-above exclusive)
  (evil-define-avy-motion avy-goto-word-0-below exclusive)
  (evilem-make-motion evilem-motion-forward-WORD-begin  #'evil-forward-WORD-begin)
  (evilem-make-motion evilem-motion-backward-WORD-begin #'evil-backward-WORD-begin)
  (evilem-make-motion evilem-motion-forward-word-end    #'evil-forward-word-end)
  (evilem-make-motion evilem-motion-forward-WORD-end    #'evil-forward-WORD-end)
  (general-def
    :keymaps 'semicolon-leader-map
    "w" 'evil-avy-goto-word-0-below
    "W" 'evilem-motion-forward-WORD-begin
    "b" 'evil-avy-goto-word-0-above
    "B" 'evilem-motion-backward-WORD-begin
    "e" 'evilem-motion-forward-word-end
    "E" 'evilem-motion-forward-WORD-end
    "ge" 'evilem-motion-backward-word-end
    "gE" 'evilem-motion-backward-WORD-end
    "j" 'evilem-motion-next-visual-line
    "k" 'evilem-motion-previous-visual-line
    "f" 'evilem-motion-find-char
    "F" 'evilem-motion-find-char-backward))
#+end_src

*** evil-snipe
#+begin_src emacs-lisp
(use-package evil-snipe
  :elpaca t
  :after evil
  :custom
  (evil-snipe-scope 'whole-visible)
  (evil-snipe-repeat-scope 'whole-visible)
  (evil-snipe-override-evil-repeat-keys nil)
  (evil-snipe-smart-case t)
  :config
  (evil-snipe-mode)
  (evil-snipe-override-mode)
  ;; (push 'telega-root-mode evil-snipe-disabled-modes)
  (my/append-to-list 'evil-snipe-disabled-modes
                     '(telega-root-mode
                       pdf-view-mode
                       ;; helpful-mode
                       nov-mode
                       ))
  ;; (push 'Custom-mode evil-snipe-disabled-modes)
  ;; (define-key evil-snipe-parent-transient-map (kbd ";")
  ;;   (evilem-create 'evil-snipe-repeat
  ;;                  :bind ((evil-snipe-scope 'buffer)
  ;;                         (evil-snipe-enable-highlight)
  ;;                         (evil-snipe-enable-incremental-highlight))))
  )
#+end_src

*** evil-org
#+begin_src emacs-lisp
(use-package evil-org
  ;; :elpaca t
  :load-path "~/code/emacs/evil-org-mode"
  :after (org evil evil-collection)
  :hook ((org-mode . evil-org-mode)
         (org-agenda-mode . (lambda ()
                              (require 'evil-org-agenda)
                              (evil-org-agenda-set-keys))))
  :config
  (evil-org-set-key-theme '(operators
                            textobjects
                            insert
                            ;; navigation
                            additional
                            ;; shift
                            todo
                            ;; heading
                            )))
#+end_src

*** evil-xkbswitch
#+begin_src emacs-lisp
(use-package evil-xkbswitch
  :elpaca (:host github :repo "linktohack/evil-xkbswitch")
  :after evil
  :diminish evil-xkbswitch-mode
  :config
  ;; If you use GNOME 41+:
  (setq evil-xkbswitch-set-layout "g3kb-switch -s"
        evil-xkbswitch-get-layout "g3kb-switch")
  (evil-xkbswitch-mode))
#+end_src

*** evil-anzu
[[*anzu][anzu]]
#+begin_src emacs-lisp
(use-package evil-anzu
  :elpaca t
  :after evil
  :bind (([remap query-replace] . anzu-query-replace)
         ([remap query-replace-regexp] . anzu-query-replace-regexp)))
#+end_src

** Keybindings
:PROPERTIES:
:header-args: :noweb-ref evil-collection-keybindings
:END:
*** General keybindings
#+begin_src emacs-lisp
(general-def :states 'motion
  "M-u" 'universal-argument
  "SPC" '(:keymap leader-map) ;; use 'Space' as leader key
  ";" '(:keymap semicolon-leader-map)
  ;; "<backspace>" 'evil-ex ;; evil command (:) state
  "<backspace>" 'execute-extended-command ;; emacs M-x
  "g h" 'evil-first-non-blank
  "g l" 'evil-end-of-line
  ;; "g b" 'ibuffer-jump
  "g b" 'bufler
  "C-s" 'evil-write
  "C-p" 'consult-yank-from-kill-ring
  "-" 'dired-jump
  "/" 'consult-line
  "?" 'evil-search-forward
  "z n" 'narrow-to-region
  "z w" 'widen
  "Z Z" 'my/evil-save-modified-buffer-and-kill-it
  "z =" 'flyspell-correct-wrapper
  "g <tab>" 'tab-new)

(general-def :states 'normal
  "g a" 'describe-char)

(general-def :states '(normal visual)
  "C-p" 'consult-yank-from-kill-ring)

(general-def :states 'visual
  "z n" (lambda ()
          (interactive)
          (narrow-to-region (region-beginning)
                            (region-end))
          (evil-exit-visual-state)))
#+end_src

#+begin_src emacs-lisp
(general-def :keymaps 'universal-argument-map
  "M-u" 'universal-argument-more)
#+end_src

#+begin_src emacs-lisp
(general-def :states 'insert
  "C-l" 'right-char
  "C-ч 8" 'iso-transl-ctl-x-8-map)
#+end_src

*** Leader map
#+begin_src emacs-lisp
(general-def :keymaps 'leader-map
  "h"  '(:keymap help-map :wk "help")
  "p"  '(:keymap projectile-command-map :which-key "projectile")
  "n"  '(:keymap my/notes-map :which-key "notes")
  "m"  '(:keymap my/bookmark-map :which-key "bookmark")
  "b"  'consult-buffer
  "ff" 'find-file
  "fo" 'consult-outline
  "fg" 'consult-ripgrep
  "fi" 'consult-imenu
  "fr" 'consult-recent-file
  "fd" 'consult-dir
  "fb" 'consult-bookmark
  "fv" 'vertico-repeat-select) ;; v for vertico
#+end_src

#+begin_src emacs-lisp
(general-def :keymaps 'help-map
  "M" 'describe-keymap)
#+end_src

*** Bookmarks
#+begin_src emacs-lisp
(general-def :keymaps 'my/bookmark-map
  "m" 'consult-bookmark
  "n" 'bookmark-set
  "b" 'bookmark-set
  "d" 'bookmark-delete
  "l" 'bookmark-bmenu-list)
#+end_src

*** LSP
**** COMMENT lsp-mode
#+begin_src emacs-lisp
(with-eval-after-load 'lsp-mode
  (general-def :keymaps 'leader-map
    "l" '(:keymap lsp-command-map :which-key "LSP")
    ;; "l" '(:keymap lsp-command-keymap :which-key "LSP")
    ))
#+end_src

*** Corfu
#+begin_src emacs-lisp
(general-def :keymaps 'corfu-map
  :states 'insert
  ;; "<escape>" 'corfu-quit
  ;; "<tab>" 'corfu-insert
  "C-о" 'corfu-next     ;; (ru)
  "C-л" 'corfu-previous ;; (ru)
  )
#+end_src

Swap ~corfu-scroll-down~ and ~corfu-scroll-up~ functions.
#+begin_src emacs-lisp
(when evil-want-C-u-scroll
  (evil-collection-define-key 'insert 'corfu-map
    (kbd "C-u") 'corfu-scroll-down))
(when evil-want-C-d-scroll
  (evil-collection-define-key 'insert 'corfu-map
    (kbd "C-d") 'corfu-scroll-up))
#+end_src

