roles/emacs/files/init.el
  (telega-directory (file-truename "~/.local/share/telega"))
  (telega-completing-read-function completing-read-function))

(use-package evil
  :elpaca t
  :init
  (setq-default evil-want-keybinding nil)
  :custom
  (evil-want-integration t)
  (evil-want-keybinding nil)
  (evil-want-C-u-scroll t)
  (evil-want-C-d-scroll t)
  (evil-want-C-i-jump t)
  ;; (evil-want-minibuffer t)
  (evil-want-fine-undo t)
  (evil-undo-system 'undo-redo)
  (evil-overriding-maps nil)
  ;; (evil-search-module 'evil-search)
  (evil-move-beyond-eol t)
  ;; (evil-ex-complete-emacs-commands 'always)
  (evil-shift-round t)
  (org-return-follows-link t)
  (evil-vsplit-window-right t)
  (evil-split-window-below t)
  :config
  (customize-set-variable 'evil-want-Y-yank-to-eol t)
  ;; (evil-select-search-module 'evil-search-module 'evil-search)
  (evil-select-search-module 'evil-search-module 'isearch)
  ;; (evil-ex-define-cmd "ls" 'ibuffer-jump)
  (evil-ex-define-cmd "ls" 'bufler)
  (evil-mode 1)
  ;; (advice-add :after 'evil-window-vsplit)
  (evil-define-command my/evil-save-modified-buffer-and-kill-it (file &optional bang)
    "Save the current buffer and kill it."
    :repeat nil
    (interactive "<f><!>")
    (when (buffer-modified-p)
      (evil-write nil nil nil file bang))
    (kill-this-buffer)
    ;; (ibuffer)
    (bufler)))

(use-package evil-collection
  :elpaca t
  :after evil
  :custom
  ;; SPC is my leader key, so forbid evil-collection to bind to it.
  (evil-collection-key-blacklist '("SPC"))
  (evil-collection-outline-bind-tab-p t)
  (evil-collection-setup-minibuffer t)
  (evil-collection-corfu-key-themes '(default tab-n-go))
  :config
  (evil-collection-init)
  (general-def :states 'motion
    "M-u" 'universal-argument
    "SPC" '(:keymap leader-map) ;; use 'Space' as leader key
    ";" '(:keymap semicolon-leader-map)
    ;; "<backspace>" 'evil-ex ;; evil command (:) state
    "<backspace>" 'execute-extended-command ;; emacs M-x
    "g h" 'evil-first-non-blank
    "g l" 'evil-end-of-line
    ;; "g b" 'ibuffer-jump
    "g b" 'bufler
    "C-s" 'evil-write
    "C-p" 'consult-yank-from-kill-ring
    "-" 'dired-jump
    "/" 'consult-line
    "?" 'evil-search-forward
    "z n" 'narrow-to-region
    "z w" 'widen
    "Z Z" 'my/evil-save-modified-buffer-and-kill-it
    "z =" 'flyspell-correct-wrapper
    "g <tab>" 'tab-new)
  
  (general-def :states 'normal
    "g a" 'describe-char)
  
  (general-def :states '(normal visual)
    "C-p" 'consult-yank-from-kill-ring)
  
  (general-def :states 'visual
    "z n" (lambda () (narrow-to-region) (evil-exit-visual-state)))
  (general-def :keymaps 'universal-argument-map
    "M-u" 'universal-argument-more)
  (general-def :states 'insert
    "C-l" 'right-char)
  (general-def :keymaps 'leader-map
    "h"  '(:keymap help-map :which-key "help")
    "p"  '(:keymap projectile-command-map :which-key "projectile")
    "n"  '(:keymap my/notes-map :which-key "notes")
    "m"  '(:keymap my/bookmark-map :which-key "bookmark")
    "b"  'consult-buffer
    "ff" 'find-file
    "fo" 'consult-outline
    "fg" 'consult-grep
    "fi" 'consult-imenu
    "fr" 'consult-recent-file
    "fd" 'consult-dir
    "fb" 'consult-bookmark
    "fv" 'vertico-repeat-select) ;; v for vertico
  (general-def :keymaps 'help-map
    "M" 'describe-keymap)
  (general-def :keymaps 'my/bookmark-map
    "m" 'consult-bookmark
    "n" 'bookmark-set
    "b" 'bookmark-set
    "d" 'bookmark-delete
    "l" 'bookmark-bmenu-list)
  (with-eval-after-load 'lsp-mode
    (general-def :keymaps 'leader-map
      "l" '(:keymap lsp-command-map :which-key "LSP")
      ;; "l" '(:keymap lsp-command-keymap :which-key "LSP")
      ))
  (general-def :keymaps 'corfu-map
    :states 'insert
    "<escape>" 'corfu-quit
    "C-l" 'corfu-insert)
