roles/emacs/files/README.org
*** Minibuffer
#+begin_src emacs-lisp
(with-eval-after-load 'vertico
  (general-def :keymaps 'vertico-map :states '(normal visual)
    "C-j" 'vertico-next
    "C-k" 'vertico-previous
    "C-l" 'vertico-insert
    "C-n" 'vertico-next-group
    "C-p" 'vertico-previous-group
    "C-f" 'vertico-scroll-up
    "C-b" 'vertico-scroll-down
    "C-d" 'consult-dir
    ;; "C-j" 'consult-dir-jump-file
    "gg" 'vertico-first
    "G"  'vertico-last
    "q" 'abort-recursive-edit)

  (general-def :keymaps 'vertico-map :states 'insert
    "C-y" 'yank
    "C-j" 'vertico-next
    "C-k" 'vertico-previous
    "C-о" 'vertico-next     ;; (ru)
    "C-л" 'vertico-previous ;; (ru)
    "C-l" 'vertico-insert
    "C-d" 'consult-dir
    "C-n" 'vertico-next-group
    "C-p" 'vertico-previous-group
    "C-f" 'vertico-scroll-up
    "C-b" 'vertico-scroll-down))
#+end_src

#+begin_src emacs-lisp :noweb-ref no
;; :bind (:map vertico-map
;;        ("C-j" . vertico-next)
;;        ("C-k" . vertico-previous)
;;        ("C-n" . vertico-next-group)
;;        ("C-p" . vertico-previous-group)
;;        ("C-l" . vertico-insert)
;;        ("C-f" . vertico-scroll-up)
;;        ("C-b" . vertico-scroll-down)
;;        ;; ("C-g" . vertico-exit)
;;        :map minibuffer-local-map
;;        ("C-h" . backward-kill-word))
#+end_src

*** Dired
**** COMMENT Dirvish
#+begin_src emacs-lisp
(general-def :keymaps 'dired-mode-map
  :states 'normal
  ;; left click for expand/collapse dir or open file
  "<mouse-1>" 'dirvish-subtree-toggle-or-open
  ;; middle click for opening file / entering dir in other window
  "<mouse-2>" 'dired-mouse-find-file-other-window
  ;; right click for opening file / entering dir
  "<mouse-3>" 'dired-mouse-find-file
  "<tab>" 'dirvish-toggle-subtree
  "<backspace>" 'dired-up-directory
  "l"   'dired-find-file
  "h"   'dired-up-directory
  "f"   'find-file
  "gh"  'dired-home-directory
  "C-o" 'dirvish-history-go-backward
  "C-i" 'dirvish-history-go-forward
  "q"   'dirvish-quit
  "?"   'dirvish-dispatch
  "gb"  '(dirvish-ibuffer :which-key "ibuffer")
  "a"   'dirvish-quick-access
  "p"   'dirvish-yank-menu
  "s"   'dirvish-quicksort
  "w"   'dirvish-layout-toggle
  "<"   'dired-prev-marked-file
  ">"   'dired-next-marked-file
  "gh"  'dirvish-history-jump)
(general-def :keymaps 'dired-mode-map
  :states 'visual
  "d" 'dired-flag-file-deletion
  "u" 'dired-unmark)
(general-def :keymaps 'dired-mode-map
  :states 'normal
  :prefix "SPC"
  "n" 'dirvish-narrow
  "m" 'dirvish-mark-menu
  "s" 'dirvish-setup-menu
  "e" 'dirvish-emerge-menu
  "l" 'dired-launch-command
  "f" '(nil :which-key t))
#+end_src

**** Dired
#+begin_src emacs-lisp
(general-def :keymaps 'dired-mode-map :states 'normal
  "SPC" '(:keymap leader-map) ;; use 'Space' as leader key
  ;; "<backspace>" 'dired-up-directory
  "<backspace>" 'execute-extended-command ;; emacs M-x
  ;; "<tab>" 'dired-subtree-cycle
  "l" 'dired-find-file
  "h" 'dired-up-directory
  "f" 'find-file
  "r" 'dired-do-rename
  "y" 'dired-ranger-copy
  "p" 'dired-ranger-paste
  "P" 'dired-ranger-move
  "w" 'dired-display-file
  ")" 'dired-omit-mode
  "<" 'dired-prev-marked-file
  ">" 'dired-next-marked-file
  "." 'hydra-dired/body
  "M-RET" 'my/dired-xdg-open)

(general-def :keymaps 'dired-mode-map :states 'visual
  "d" 'dired-flag-file-deletion
  "u" 'dired-unmark)
#+end_src

***** dired hydra
#+begin_src emacs-lisp
(defhydra hydra-dired (:hint nil :color pink)
  "
_Y_ rel symlink    _O_pen marked
_S_ymlink          _n_ narrow
_z_ compress-file  _m_ chmod        _s_ort           _E_ ediff
_Z_ compress       _g_ chgrp        _e_xtension mark   _=_ pdiff
"
  ("+" dired-maybe-create-dirs)
  ("=" diredp-ediff) ;; smart diff
  ("e" dired-mark-extension)
  ("E" dired-ediff-files)
  ("g" dired-do-chgrp)
  ("m" dired-do-chmod)
  ("n" dired-narrow)
  ("O" dired-do-find-marked-files) ;; open in Emacs all marked files
  ;; ("o" dired-display-file)
  ;; ("r" dired-do-rsynch)
  ("S" dired-do-symlink)
  ("s" dired-sort-toggle-or-edit)
  ("Y" dired-do-relsymlink)
  ("z" diredp-compress-this-file)
  ("Z" dired-do-compress)
  ("q" nil)
  ("." nil :color blue)
  ("<escape>" nil :color blue))
#+end_src

*** Magit
#+begin_src emacs-lisp
(with-eval-after-load 'magit-section
  (general-def :keymaps 'magit-section-mode-map
    :states 'normal
    "g h" 'evil-first-non-blank
    "g l" 'evil-end-of-line
    "C-j" 'magit-section-forward-sibling
    "C-k" 'magit-section-backward-sibling
    "z j" 'magit-section-forward-sibling
    "z k" 'magit-section-backward-sibling
    "z u" 'magit-section-up
    "z t" 'evil-scroll-line-to-top
    "z z" 'evil-scroll-line-to-center
    "z b" 'evil-scroll-line-to-bottom)

  (general-def :keymaps 'with-editor-mode-map
    :states 'normal
    "SPC SPC" 'with-editor-finish
    "Q"  'with-editor-cancel
    "ZZ" 'with-editor-finish
    "ZQ" 'with-editor-cancel))
#+end_src

*** Bufler
#+begin_src emacs-lisp
(general-def :keymaps 'bufler-list-mode-map
  :states 'normal
  "<return>" 'bufler-list-buffer-switch
  "C-s" 'bufler-list-buffer-save
  "g r" '(bufler :which-key "refresh")
  "d" 'bufler-list-buffer-kill
  "x" 'bufler-list-buffer-kill
  "W" 'bufler-list-buffer-peek
  "?" 'hydra:bufler/body)
#+end_src

*** Origami
#+begin_src emacs-lisp
(general-def :keymaps 'origami-mode-map
  :states 'normal
  "z j" 'origami-forward-fold
  "z k" 'origami-previous-fold)
#+end_src

*** Outline
#+begin_src emacs-lisp
(general-def :keymaps 'outline-mode-map
  :states 'normal
  "<tab>" 'outline-cycle
  "z m" 'my/outline-hide-sublevels
  "z j" 'outline-next-visible-heading
  "z k" 'outline-previous-visible-heading)
#+end_src

**** my functions for outline keybindings
#+begin_src emacs-lisp
(defun my/outline-hide-sublevels (levels)
  (interactive "p")
  (outline-hide-sublevels (or levels 1)))
#+end_src

*** Org-mode
#+begin_src emacs-lisp
(general-def :keymaps 'my/orgmode-leader-map
  "SPC" 'org-ctrl-c-ctrl-c
  "n i" 'org-id-get-create
  "n p" 'org-set-property
  "n h" 'org-babel-insert-header-arg
  "n f" 'org-footnote-action
  "l" 'org-insert-link
  "d" 'org-deadline
  "s" 'org-schedule
  "t" 'org-time-stamp
  "T" 'org-time-stamp-inactive
  "L" 'org-cliplink
  "a" 'org-attach
  "[" 'org-agenda-file-to-front
  "]" 'org-remove-file
  "|" 'org-table-create-or-convert-from-region)
#+end_src

#+begin_src emacs-lisp
;; (general-def :keymaps 'org-src-mode-map
;;   :states 'normal
;;   "z '" 'org-edit-src-exit)
#+end_src

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (general-def :keymaps 'org-mode-map
    :states '(normal visual)
    "g h" 'evil-org-beginning-of-line
    "g l" 'evil-org-end-of-line
    ;; "H" 'org-up-element
    ;; "L" 'org-down-element
    "g x" 'org-open-at-point
    "z n" 'org-narrow-to-subtree
    "z '" 'org-edit-special
    "z ," 'org-insert-structure-template
    "z /" 'org-sparse-tree
    "z ;" 'org-toggle-comment
    "SPC" '(:keymap my/orgmode-leader-map)
    "K"   'helpful-at-point
    "M-q" 'unpackaged/flex-fill-paragraph)

  (general-def :keymaps 'org-mode-map
    :states 'insert
    "C-t" 'evil-shift-right-line
    "C-d" 'evil-shift-left-line))

(add-hook 'evil-org-mode-hook
          (lambda ()
            (general-def :keymaps 'local :states 'insert
              "C-t" 'evil-shift-right-line
              "C-d" 'evil-shift-left-line)))
  #+end_src

**** Org transclusion
#+begin_src emacs-lisp
(general-def
  :keymaps 'org-transclusion-map
  :states 'normal
  ;; "e" #'org-transclusion-live-sync-start
  ;; "g" #'org-transclusion-refresh
  ;; "d" #'org-transclusion-remove
  ;; "C-d" #'org-transclusion-detach
  ;; "P" #'org-transclusion-promote-subtree
  ;; "D" #'org-transclusion-demote-subtree
  ;; "o" #'org-transclusion-open-source
  ;; "O" #'org-transclusion-move-to-source
  "gi" #'org-transclusion-live-sync-start)
#+end_src

#+begin_src emacs-lisp
(general-def
  :keymaps 'org-transclusion-live-sync-map
  :states 'normal
  ;; "C-c C-c" #'org-transclusion-live-sync-exit
  ;; "C-y" #'org-transclusion-live-sync-paste
  "q" #'org-transclusion-live-sync-exit)
#+end_src

*** Org-Roam
#+begin_src emacs-lisp
(general-def :keymaps 'my/notes-map
  "I" 'org-roam-create-untracked-node
  "a" 'org-agenda
  "s" 'org-store-link
  "n" 'org-roam-node-find
  "c" 'org-roam-capture
  "b" 'org-roam-buffer-toggle
  "v" 'org-switchb
  "l" 'org-roam-node-insert
  "t" 'org-roam-tag-add
  "u" 'org-roam-ui-mode
  "d" '(:keymap org-roam-dailies-map)
  "/" 'consult-org-roam-search)

(general-def :keymaps 'org-roam-dailies-map
  "Y" 'org-roam-dailies-capture-yesterday
  "T" 'org-roam-dailies-capture-tomorrow)
#+end_src

