roles/emacs/files/init.el
  (with-eval-after-load 'vertico
    (general-def :keymaps 'vertico-map :states '(normal visual)
      "C-j" 'vertico-next
      "C-k" 'vertico-previous
      "C-l" 'vertico-insert
      "C-n" 'vertico-next-group
      "C-p" 'vertico-previous-group
      "C-f" 'vertico-scroll-up
      "C-b" 'vertico-scroll-down
      "C-d" 'consult-dir
      ;; "C-j" 'consult-dir-jump-file
      "gg" 'vertico-first
      "G"  'vertico-last
      "q" 'abort-recursive-edit)
  
    (general-def :keymaps 'vertico-map :states 'insert
      "C-y" 'yank
      "C-j" 'vertico-next
      "C-k" 'vertico-previous
      "C-l" 'vertico-insert
      "C-d" 'consult-dir
      "C-n" 'vertico-next-group
      "C-p" 'vertico-previous-group
      "C-f" 'vertico-scroll-up
      "C-b" 'vertico-scroll-down))
  (general-def :keymaps 'dired-mode-map :states 'normal
    "SPC" '(:keymap leader-map) ;; use 'Space' as leader key
    ;; "<backspace>" 'dired-up-directory
    "<backspace>" 'execute-extended-command ;; emacs M-x
    ;; "<tab>" 'dired-subtree-cycle
    "l" 'dired-find-file
    "h" 'dired-up-directory
    "f" 'find-file
    "r" 'dired-do-rename
    "y" 'dired-ranger-copy
    "p" 'dired-ranger-paste
    "P" 'dired-ranger-move
    "w" 'dired-display-file
    ")" 'dired-omit-mode
    "<" 'dired-prev-marked-file
    ">" 'dired-next-marked-file
    "." 'hydra-dired/body
    "M-RET" 'my/dired-xdg-open)
  
  (general-def :keymaps 'dired-mode-map :states 'visual
    "d" 'dired-flag-file-deletion
    "u" 'dired-unmark)
  (defhydra hydra-dired (:hint nil :color pink)
    "
  _Y_ rel symlink    _O_pen marked
  _S_ymlink          _n_ narrow
  _z_ compress-file  _m_ chmod        _s_ort           _E_ ediff
  _Z_ compress       _g_ chgrp        _e_xtension mark   _=_ pdiff
  "
    ("+" dired-maybe-create-dirs)
    ("=" diredp-ediff) ;; smart diff
    ("e" dired-mark-extension)
    ("E" dired-ediff-files)
    ("g" dired-do-chgrp)
    ("m" dired-do-chmod)
    ("n" dired-narrow)
    ("O" dired-do-find-marked-files) ;; open in Emacs all marked files
    ;; ("o" dired-display-file)
    ;; ("r" dired-do-rsynch)
    ("S" dired-do-symlink)
    ("s" dired-sort-toggle-or-edit)
    ("Y" dired-do-relsymlink)
    ("z" diredp-compress-this-file)
    ("Z" dired-do-compress)
    ("q" nil)
    ("." nil :color blue)
    ("<escape>" nil :color blue))
  (with-eval-after-load 'magit-section
    (general-def :keymaps 'magit-section-mode-map
      :states 'normal
      "g h" 'evil-first-non-blank
      "g l" 'evil-end-of-line
      "C-j" 'magit-section-forward-sibling
      "C-k" 'magit-section-backward-sibling
      "z j" 'magit-section-forward-sibling
      "z k" 'magit-section-backward-sibling
      "z u" 'magit-section-up
      "z t" 'evil-scroll-line-to-top
      "z z" 'evil-scroll-line-to-center
      "z b" 'evil-scroll-line-to-bottom)
  
    (general-def :keymaps 'with-editor-mode-map
      :states 'normal
      "SPC SPC" 'with-editor-finish
      "Q"  'with-editor-cancel
      "ZZ" 'with-editor-finish
      "ZQ" 'with-editor-cancel))
  (general-def :keymaps 'bufler-list-mode-map
    :states 'normal
    "<return>" 'bufler-list-buffer-switch
    "C-s" 'bufler-list-buffer-save
    "g r" '(bufler :which-key "refresh")
    "d" 'bufler-list-buffer-kill
    "x" 'bufler-list-buffer-kill
    "W" 'bufler-list-buffer-peek
    "?" 'hydra:bufler/body)
  (general-def
    :keymaps 'outline-mode-map
    :states 'normal
    "<tab>" 'outline-cycle
    "z j" 'outline-next-visible-heading
    "z k" 'outline-previous-visible-heading
    "z m" 'my/outline-hide-sublevels)
  (defun my/outline-hide-sublevels (levels)
    (interactive "p")
    (outline-hide-sublevels (or levels 1)))
  (general-def :keymaps 'my/orgmode-leader-map
    "SPC" 'org-ctrl-c-ctrl-c
    "n i" 'org-id-get-create
    "n p" 'org-set-property
    "n h" 'org-babel-insert-header-arg
    "l" 'org-insert-link
    "d" 'org-deadline
    "s" 'org-schedule
    "t" 'org-time-stamp
    "T" 'org-time-stamp-inactive
    "L" 'org-cliplink
    "a" 'org-attach
    "[" 'org-agenda-file-to-front
    "]" 'org-remove-file)
  (general-def :keymaps 'org-src-mode-map :states 'normal
    "z '" 'org-edit-src-exit)
  (with-eval-after-load 'org
    (general-def :keymaps 'org-mode-map :states '(normal visual)
      "g h" 'evil-org-beginning-of-line
      "g l" 'evil-org-end-of-line
      ;; "H" 'org-up-element
      ;; "L" 'org-down-element
      "g x" 'org-open-at-point
      "z n" 'org-narrow-to-subtree
      "z '" 'org-edit-special
      "z ," 'org-insert-structure-template
      "z /" 'org-sparse-tree
      "z ;" 'org-toggle-comment
      "SPC" '(:keymap my/orgmode-leader-map)
      "K" 'helpful-at-point)
  
    (general-def :keymaps 'org-mode-map
      :states 'insert
      "C-t" 'evil-shift-right-line
      "C-d" 'evil-shift-left-line))
  
  (add-hook 'evil-org-mode-hook
            (lambda ()
              (general-def :keymaps 'local :states 'insert
                "C-t" 'evil-shift-right-line
                "C-d" 'evil-shift-left-line)))
  (general-def
    :keymaps 'org-transclusion-map
    :states 'normal
    ;; "e" #'org-transclusion-live-sync-start
    ;; "g" #'org-transclusion-refresh
    ;; "d" #'org-transclusion-remove
    ;; "C-d" #'org-transclusion-detach
    ;; "P" #'org-transclusion-promote-subtree
    ;; "D" #'org-transclusion-demote-subtree
    ;; "o" #'org-transclusion-open-source
    ;; "O" #'org-transclusion-move-to-source
    "gi" #'org-transclusion-live-sync-start)
  (general-def
    :keymaps 'org-transclusion-live-sync-map
    :states 'normal
    ;; "C-c C-c" #'org-transclusion-live-sync-exit
    ;; "C-y" #'org-transclusion-live-sync-paste
    "q" #'org-transclusion-live-sync-exit)
  (general-def :keymaps 'my/notes-map
    "a" 'org-agenda
    "s" 'org-store-link
    "n" 'org-roam-node-find
    "c" 'org-roam-capture
    "b" 'org-roam-buffer-toggle
    "v" 'org-switchb
    "l" 'org-roam-node-insert
    "t" 'org-roam-tag-add
    "u" 'org-roam-ui-mode
    "d" '(:keymap org-roam-dailies-map))
  
  (general-def :keymaps 'org-roam-dailies-map
    "Y" 'org-roam-dailies-capture-yesterday
    "T" 'org-roam-dailies-capture-tomorrow)
  (general-def
